[{"text": "Spent 6.5 weeks in Ōsaka. Having had many things to do in mind and being aware of the limited amount of time, things felt a bit rushed at times. Nevertheless pleased with how the stay went in general and what I got done. :)\r\n\r\n* Book hunt  \r\n    After finishing 『九州は横浜のどこですか？』 on my Kindle last year, I struggled to really get into another book. Only my physical copy of 『日本語雑記帳』 found its way into my hands from time to time. I therefore went on somewhat of a book hunt this time and spent many hours in BOOKOFFs and a considerable amount of my short Tokyo trip in 神保町. What I ended up bringing home with me is:\r\n    * 『世界の文字』 (done reading)\r\n    * 『日本語びいき』 (almost done reading)\r\n    * 『活版印刷三日月堂』 (half way through the first of the 4 books)\r\n    * 『ユニコード戦記』\r\n    * 『「舞姫」の主人公をバンカラとアフリカ人がボコボコにする最高の小説の世界が  \r\n        　明治に存在したので20万字くらいかけて紹介する本』\r\n    * 『文系と理系はなぜ分かれたのか』\r\n    * 『字幕屋に「、」はない』\r\n    * 『辞書編集、三十七年』\r\n    * 『印刷に恋して』\r\n    * 『教室内カースト』\r\n    * 『同時通訳はやめられない』\r\n    * 『鳩居堂の日本のしきたり豆知識』\r\n    * 『タイポさんぽ』\r\n    * 『ようこそ保健室へ』\r\n    * 『パッタを倒しにアフリカへ』\r\n* <!-- mixlang:親指シフト:Japanese thumb-shift input -->  \r\n    I made a conscious decision to switch from QUERTY to <!-- mixlang:フリック入力:flick input --> on my phone years ago in order to internalize thinking of the words I input as being made up of <!-- mixlang:かな:かな (kana) --> and not Latin alphabet characters. While in Ōsaka I found out about <!-- mixlang:親指シフト:Japanese thumb-shift input --> and ended up getting a [cheap keyboard](https://www.amazon.co.jp/gp/product/B01I2ZI5NS/) labelled accordingly for testing. Got it to work on my Ubuntu 18.04 system using [oyainput](https://github.com/inwskatsube/oyainput). Time will tell whether or not I'll have the frustration tolerance and endurance to make the switch. Will also have to test if a Votex CORE (the keyboard I'm using most of the time currently) can be programmed accordingly.\r\n* <!-- mixlang:漢字検定:Japan Kanji Aptitude Test -->  \r\n    Took the <!-- mixlang:漢検:Japan Kanji Aptitude Test --> <!-- mixlang:5級:level 5 (goes from 10 (easiest) to 1 (hardest)) --> as well as 4級 and passed both. :)\r\n    * arrived early and saw a parade of <!-- mixlang:ちびっ子:kids --> streaming out of the building :3\r\n    * question sheets were basically huge (257×379 mm) [<!-- mixlang:圧着ハガキ:a type of unfold postcard often used in Japan for privacy sensitive information -->](https://www.youtube.com/watch?v=z08twtN0E-E), resulting in quite the sound when a room full of people simultaneously opened them \r\n    * sitting next to me taking 4級 was a 9 year old D:\r\n* Can recommend 大阪府立中之島図書館 to everyone in Ōsaka looking for a quiet space with air conditioning, power sockets and free wifi (registration required, was a bit buggy on PC but ended up working) \r\n* Entered a Carcassonne tournament (カルカソンヌ日本選手権). Won 2 games and then was destroyed twice by more serious (nevertheless super nice) contestants.\r\n* Visited people at <!-- mixlang:京大:Kyōto University --> and met again with colleagues at NII\r\n* Attended [活版WEST](https://www.kappan-west.com/)\r\n* Stayed at a 旅館\r\n* Finally got to the end of [うぶんちゅ！ chapter 12](https://gitlab.com/sirtetris/ubunchu-translation/commit/d60fa4e905bef04addbb3aa90078c8d588274053) after translating the first few pages some time last year.\r\n* Visited 遊舎工房 and [got some keycaps](https://twitter.com/IllDepence/status/1150729524881047552)\r\n* Was able to eat at 丸香 and MENSHO again while in Tokyo\r\n* Went to see [<!-- mixlang:下赤阪の棚田:terraced rice-fields -->](https://twitter.com/IllDepence/status/1143489362497134593), which ended up being a *ride a train, then ride a bus, be the last person left in the bus, walk a bit, talk to the ground keeper of a school and be let through a few gates you're not supposed to go through as an outsider, arrive and be the only person around* type of trip—i.e. a diametric opposite to the sad state of over commercialized tourist destinations—i.e. awesome :)\r\n* Saw a [person poking out of a ticket machine](static/img/blog/osaka_add_0.jpg) for the first time. :'D\r\n\r\nLocation wise Ōsaka was nice to explore the Kansai region a bit, but didn't quite click with me the way Tōkyō did. Guess with a bunch of disparate, rather niche interests, Tōkyō is hard to beat just because of its sheer size.", "id": "f29d4d64", "tags": ["japanese", "kanji", "travel", "research", "books"], "date": "2019-07-15", "headline": "大阪短期滞在", "image": "osaka_2019.jpg"}, {"text": "Several times within the last year, maybe two, I ventured into the depths of the interwebs in search of a monolingual Japanese dictionary app that could be used offline. What I found was JE-EJ dictionaries, 広辞苑第七版 for €89.99 and people in forums suggesting apps that wouldn't work offline. On my most recent desperate search I even came across a *geoblocked dictionary* app—to top it all off by a company deriving their name from the words \"big\" and \"globe\". m(\r\n\r\nAt this point I thought about just solving the problem myself. Looking at some dictionary websites, I found one where the entries were nicely enumerated from 1 to 297,199, so I wrote a small crawling script. In the meantime I used scholarly search engines to see if there happened to be some open data sets that could be used. I would've just thrown terms and definitions in an SQLite DB and installed some SQLite viewer on my phone.\r\n\r\nIn the end I found a better solution. One that's accessible and doesn't require technical skill—which is why I'm writing this. Watching [this video](https://www.youtube.com/watch?v=D-AfT8XW63w) (by [this guy](https://massimmersionapproach.com/about/)) I learned about [EPWING](https://ja.wikipedia.org/wiki/EPWING), a JIS standardized [format](https://web.archive.org/web/20060106055719/http://www.epwing.or.jp/about/about.html) for digital dictionaries. Now, looking at aforementioned video you might get your hands on some such dictionaries. All you then need is an app to interface with them: I quickly found [DroidWing](https://play.google.com/store/apps/details?id=com.aokabi.android.droidwingfree), which I happily link here because the author also distributes a [paid version](https://play.google.com/store/apps/details?id=com.aokabi.android.droidwing) where the only difference is the icon color. <3\r\n\r\nSo yeah, not bound to any service provider, platform independent, offline ... 国語辞典 case solved for good. :3\r\n\r\n(This is just to feed the Google, in case someone else also looks for a solution to this: アンドロイド アプリ 国語辞典 国語 辞典 辞書 オフライン 無料.)", "id": "bbcb7e53", "tags": ["japanese"], "date": "2019-03-24", "headline": "Monolingual Japanese offline dictionaries for Android", "image": "kokugojiten.jpg"}, {"text": "[Five years ago](?a=662849f9) I realized Amazon deems Japanese books incompatible with the [Kindle 4](https://wiki.mobileread.com/wiki/Amazon_Kindle_4) and suggested using [<!-- mixlang:青空文庫:the Japanese equivalent of Project Gutenberg -->](https://www.aozora.gr.jp/) as an alternative source for e-books. While I wholeheartedly suggest you always search for [DRM free](https://www.defectivebydesign.org/) sources for your e-books first, there are cases where Amazon simply seems to be the only available source.\r\n\r\nIn the following I'm going to show a viable way to handle Japanese e-books from Amazon, for people still holding on to a Kindle 4.\r\n\r\n**what does work**\r\n\r\n* vertical writing with PDFs\r\n* Japanese file names\r\n\r\n**what doesn't seem to work**\r\n\r\n* vertical writing with AZW3 files\r\n* highlighting text in vertical writing\r\n* links (e.g. from the TOC) in vertical writing\r\n* proper dictionary function\r\n\r\nBefore jumping right into the technical stuff, be reminded that *if* you're okay with reading on your PC or phone, the easy solution is to just get the Kindle app and have your e-book delivered to that. If it is to be the Kindle, here's how that works:\r\n\r\nIf you're on Linux, get a [Windows 10 VM](https://developer.microsoft.com/en-us/windows/downloads/virtual-machines), install the Kindle app and load the books you want to transfer to your kindle from your library. Now, word has it there are ways to free books you bought from Amazon from their DRM. For the purpose of this explanation we're just going to assume you have a DRM free AZW3 file. If you prefer to read your book in horizontal writing, you're basically done at this point. Copy the file to your Kindle and curse Amazon for not allowing you to send it to the device directly. For verical writing there are a few more steps to go through.\r\n\r\nIf you haven't already done so, download [Calibre](https://www.calibre-ebook.com/) and add a book (probably a AZW3-file) to your collection. To generate a PDF with vertical writing we're going to use [<!-- mixlang:青空キンドル:a very nice website -->](http://a2k.aill.org/text.html) which takes plain text as input. Unfortunately, exporting a book as TXT in Calibre will mess with furigana (append them as normal text). To get proper furigana, export the book as HTMLZ and from the resulting archive extract the file `index.html`. To convert the HTML file into plain text  while preserving furigana in a format <!-- mixlang:青空キンドル:aforementioned website --> understands, use the script `html2txt_ruby.py` from [this repository](https://github.com/IllDepence/calibre_html2aozora_txt). Running `python3 html2txt_ruby.py index.html` will give you a file `out.txt`. Use this as your input for 青空キンドル (you will most likely want to edit the first few lines of the text to get a proper cover page).\r\n\r\nNow, PDF file names. Five years ago I noticed [problems with book names](static/img/blog/jp_kindle_3.jpg) when just copying over PDF files with Japanese names. The Kindle takes the author's name from a PDF's metadata, but doesn't do this for the title. The title is taken from the file name and non Latin characters in file names can be a mess to deal with on FAT file systems. To get Japanese file names for PDFs properly displayed, mount your kindle with the parameter `-o uni_xlate=1`\\* and use the script `uni_xlate_filename.py` from [this repository](https://github.com/IllDepence/calibre_html2aozora_txt) generate an encoded file name. Example: running `python3 uni_xlate_filename.py 使用例` will give you `:4f7f:7528:4f8b`. Meaning if you name a PDF file on your Kindle `:4f7f:7528:4f8b.pdf` while mounted with the parameter mentioned above, it will show up as `使用例` on the device.\r\n\r\nAnd with that you can enjoy Japanese books from Amazon in vertical writing on a Kindle 4. No need to abandon a device that's still working perfectly fine. :)  \r\n\r\n<small>\\*See man page of [mount](https://linux.die.net/man/8/mount) (search for \"unhandled Unicode\") for details.</small>", "id": "1b33363e", "tags": ["japanese", "hardware"], "date": "2018-09-20", "headline": "Japanese books on a Kindle 4", "image": "jp_kindle_2018.jpg"}, {"text": "Nine months in Japan — last review:\r\n\r\nGiven I already felt like *on my way back* towards the end of last month, my last weeks felt pretty relaxed. Rather than squeezing a lot of activities into the short time left I was able to pretty much go with an everyday pace. Nevertheless I ended up doing some stuff I'm really happy I was able to do before I left.  \r\n\r\n* general\r\n    * I decided to write a German Wikipedia article on [flick input](https://de.wikipedia.org/wiki/Flick-Input). Given the corresponding Japanese article, which I used as a base, was lacking references, I went on a hunt through Japanese papers on the topic. Several works on specific related matters cited a paper with the title *<!-- mixlang:タッチパネル搭載ケータイにおける入力方式の評価:An evaluation of input system on the touch panel phone -->* for their general explanation of what flick input is. Unfortunately, the paper was nowhere to be found online. Given that CiNii, the bibliographic database where I at least found the paper *mentioned* online outside of the reference sections of other papers, is a service by the very institute I was working at, I decided to check out our library. Even one of the library personnel checked for any trace, but to no avail. No printed matter available and no online access in any of the subscriptions of the NII. What do you do at that point? Easy: hop on your bike and pay a short visit to [one of the largest libraries in the world](https://en.wikipedia.org/wiki/National_Diet_Library). (Tokyo's awesome in some aspects.) So after finding out the <!-- mixlang:シンポジウムモバイル研究論文集 2010:Proceedings of the symposium on mobile interactions 2010 --> (the journal containing the paper) wasn't available through NII, I looked again online and found out the <!-- mixlang:国立国会図書館:National Diet Library of Japan --> had a copy. So, go there, get a library card made, file a viewing request for the journal, *finally* get my hands on the thing, read the paper to make sure it's actually something I can use as a reference, file a copying request, get the copy, take a [sneaky blurry picture](static/img/blog/nii_add_08.jpg) to commemorate my success and return the journal. \r\n    * met a friend from Matsuyama who was awesome enough to come all the way to Tokyo\r\n    * played some *Shadow Tactics: Blades of the Shogun*\r\n    * finally found a case/bag for my Vortex CORE — it's for lenses and thus has a circle profile but apart from that fits the size perfectly\r\n    * found a <!-- mixlang:[ギザ十](https://ja.wikipedia.org/wiki/%E3%82%AE%E3%82%B6%E5%8D%81):10 Yen coin with a reeded edge (they made them like that for the first 8 years) -->\r\n    * visited a Escher exhibition where the audio guide was spoken by <!-- mixlang:バカリズム:my favorite Japanese comedian -->\r\n    * was surprised to reach the gate and find out I was going to fly home in the [BB-8 ANA JET](static/img/blog/nii_add_09.jpg)\r\n* at the institute\r\n    * had some meetings that, for a change, were in Japanese\r\n    * was able to help with the technical setup for a art history class at <!-- mixlang:東大:the University of Tokyo -->\r\n    * got my certificate for completing the internship\r\n\r\nAll in all a *really* enjoyable finish to a, looking back, invaluable 9 months. From a professional perspective: great. Japanese progress: surprisingly satisfactory. Sports: outright neglect on my part. Note for next time: establish a sports routine *early on*.\r\n\r\nOn to the ... well, I'm sure I'll be back in the foreseeable future. :3", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "2cea3972", "date": "2018-07-15", "headline": "国立情報学研究所〔九〕", "image": "nii_09.jpg"}, {"text": "Month eight — second to last. D:\r\n\r\nThe runway lights back home are already switching on — one by one.\r\n\r\nSome better balanced I/O compared to last time:\r\n\r\n* general\r\n    * was able to take a week off to show my family around here in Tokyo\r\n    * had a peek into an interesting enthusiasts' sphere at the HHKB user meetup vol.2\r\n    * spent the good part of a day in <!-- mixlang:横浜:Yokohama --> and <!-- mixlang:川越:Kawagoe -->\r\n    * rode crazy rollercoasters at Fuji-Q Highland\r\n    * got a Vortex CORE — wasn't able to find a nice case/sleeve/transport option yet, thorugh\r\n* at the institute\r\n    * things are going at a reasonable pace again after last month's \"spurt before the deadline\"\r\n    * slowly getting more used to bending my work to external requests/compatibility requirements\r\n\r\nAll in all this month felt like a prolonged transition from *just being in Japan*, over *doing some stuff before it's too late* to *already on my way back*.\r\n\r\nOn to the last month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "65db521a", "date": "2018-06-18", "headline": "国立情報学研究所〔八〕", "image": "nii_08.jpg"}, {"text": "Month seven — two more to go. Quick review:\r\n\r\nThis month felt a bit packed. A lot of nice output and interesting input though. So all in all good progress — I only wish there was more time to get hyped about upcoming and let sink in recently experienced stuff.\r\n\r\nAnyway, I/O:\r\n\r\n* general\r\n    * saw <!-- mixlang:琵琶湖:Lake Biwa(ko? — the ko means lake) --> and <!-- mixlang:近江神宮:the shrine where the anual Karuta chapionship takes place -->\r\n    * got out a new chapter of my [<!-- mixlang:うぶんちゅ！:Ubunchu! -->](?a=d932debd) translation\r\n    * was at <!-- mixlang:ニコニコ超会議2018:the Japan equivalent of Vidcon if it were hosted by YouTube (?) --> — for work, actually; kind of\r\n    * attended <!-- mixlang:ゲームマーケット:Game Market --> and COMITIA\r\n    * had a great time at the Tokyo Mechanical Keyboard Meetup Vol. 4\r\n* at the institute\r\n    * writing businessy e-mails in Japanese gets easier and easier\r\n    * was working on and with two web applications that more or less are the backend for a larger project which had to reach a presentable state until today. The whole thing having several interdependent people, parts and working steps involved and being interdisciplinary is interesting, really. But it's also waaay more draining that just building something on your own.\r\n\r\nHoping for some less I/O heavy times in the coming days. \r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "ffef387e", "date": "2018-05-18", "headline": "国立情報学研究所〔七〕", "image": "nii_07.jpg"}, {"text": "Month six — two thrids done; one to go.\r\n\r\nGoing by the initial schedule this would've been my fifth day back in Germany. Glad I still have time to enjoy Japan now that it's finally not cold anymore. Maybe it'll be sick of the heat and humidity in July making it easier to go. ^_^    \r\n\r\nAs always, stuff happened:\r\n\r\n* general\r\n    * bought a <!-- mixlang:座椅子:Japanese chair with no legs -->\r\n    * enjoyed a sunny Saturday in <!-- mixlang:隅田公園:Sumida Park -->, sitting on a stone wall reading a book, and saw three old ladies looking for somewhere to sit, so moved a bit to the side. Continuing my book I was handed a piece of <!-- mixlang:唐揚げ:fried chicken -->, two pieces of sushi and a some <!-- mixlang:和菓子:Japanese sweets --> — no small talk or questions, just <!-- mixlang:「はい。昼ご飯です。」:&quot;Here. That's your lunch.&quot; -->. :'D\r\n    * started making my own <!-- mixlang:弁当:lunch boxes --> as a change to caffeteria food \r\n    * visited <!-- mixlang:かなまら祭り:the Kanamara festival --> which was great fun\r\n    * was able to see some of the people that, through their videos, introduced me to Japan before I came here the first time over two years ago, irl at a YouTube hanami\r\n    * lots of nice new people at the share house\r\n    * had my first <!-- mixlang:馬刺し:basashi (raw, sliced horse meat) --> — tasty :)\r\n* at the institute\r\n    * started developing a piece of software that interacts with an application being developed by an external developer — both projects being in a prototype phase and the whole thing being orchestrated by my superviser. As a result I'm reading and writing *a lot* of Japanese e-mails — more <!-- mixlang:敬語:formal Japanese --> practice. orz\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "a1eb47f3", "date": "2018-04-18", "headline": "国立情報学研究所〔六〕", "image": "nii_06.jpg"}, {"text": "Month five of <s>six</s> *nine!*\r\n\r\nAnki was not bad; sport very much insufficient; most importantly though my stay got extended by 3 months. :) Time to take a step back, shake off the *oh no I'm leaving in a few weeks* mindset and take a deep breath. :3\r\n\r\nAnyway, here's the listy thing:\r\n\r\n* general\r\n    * went to a meetup for people interested in i18n/l10n innovations and found myself walking up to a nice reception lady in front of a room with classic music playing and not a single person not wearing a suit in it — until I entered, that is. After reassurance of the event's host that this is a casual get-together, an immensely butchered self introduction to the group from my side, free Dr. Pepper and some interesting presentations, the following <!-- mixlang:懇親会:informal get-together (in this context the informal part at a bar after the formal presentation part of the event) --> was great though. Exchanged a lot of <!-- mixlang:名刺:business cards --> and had good conversations with the folks there\r\n    * had my frist proper VR experience (as in not just a headset) in the form of a [planetarium / VR attraction](http://megastarjourney.com/about.html) using a Japanese VR system called [ABAL](https://www.abal.jp/)\r\n    * watched Stranger Things, <!-- mixlang:ちはやふる -結び-:the 3rd Chihayafuru movie --> and way too much AoE2 videos on YouTube\r\n    * finally did some [geocaching](static/img/blog/nii_add_07.jpg) in the area where I'm living currently\r\n* at the institute\r\n    * diving deep into linked data stuff lately (if someone knows how to configure a few arbitrary\\* inference rules for data stored and accessed through a Fuseki 3.6 instance *PLEASE* tell me)<br>\\*meaning not just RDFS or OWL statements\r\n    * arranged my workspace as a standing desk (very improvised but it works)\r\n\r\nOn to the *not last* month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "c195381f", "date": "2018-03-18", "headline": "国立情報学研究所〔五〕", "image": "nii_05.jpg"}, {"text": "A few days ago I was wasting a few seconds on Facebook, scrolling down the newsfeed, and was suprised to see a short Japanese post, <!-- mixlang:「残念だな」:&quot;what a pity&quot; -->, by someone I was pretty sure doesn't know Japanese. Upon closer inspection it turned out Facebook had translated their German post into the language my account is set to display. This made me very aware — for a moment — that the fact in which language something is written carries information. Why did *they* suddenly post in Japanese? (Well ... they didn't.)  \r\nIf, let's say, a Chinese acquaintance of whom I know that they don't know any German sent me birthday whishes in German, then they went through the trouble of goolging for German birthday whishes, using Google Translate or asking someone. In a similar fashion I report of elevators saying <!-- mixlang:「本日はご苦労様でした」:&quot;Thank you for your hard work today&quot; --> at my lab — because they do so in Japanese. Other times using a word from another language is just more concise and feels more accurate. Instead of talking about *\"a type of bicycle with a front basked often used by mothers\"* or leaving out information and just writing *\"bicycle\"* I name the thing by its name and say <!-- mixlang:「ママチャリ」:&quot;mama-chari&quot; -->. \r\n\r\nThe obvious problem with this is that my recent blog posts only really make sense to people that can read English and — at least some — Japanese. This made me think about working with `Accept-Language` headers. Just parse what a user's browser tells me about their language capabilities and display content accordingly.\r\n\r\nTo figure out how I'd go about the *display content accordingly* part I googled *\"mixed language web content\"* and similar things. This yielded a lot of SEO articles saying *DON'T!*, a few W3C resources on how to mark and style parts of text depending on language and even an interesting looking book titled *Language Mixing and Code-Switching in Writing*. No solution though for my balancing act between information/authenticity and audience/intelligibility.\r\n\r\nSo, I played around myself and [came up with](https://github.com/IllDepence/mixed-language-web-content-test) this: <!-- mixlang:例:example --> ← if your browser tells me you understand Japanese you will just see 「例」, otherwise the word will have a grey-ish background and when you hover over it, it will display \"example\".  \r\nBest thing about them? They're purely done in CSS. :3 (See [the code here](https://github.com/IllDepence/mixed-language-web-content-test/blob/master/single.html).) On the server side of things it gets a little bit unaesthetic — sadly. I maintain the contents of this website in Markdown and extra stuff is added in *after* parsing. For mixed language strings I use the following construct `<‌!-- mixlang:例:example -->`. Not quite as concise as e.g. Markdown links but well ... HTML comments go through the parser untouched and then I built my small `<span>` matryoshkas. Writing a Markdown extention would be an alternative but I don't have the time for looking into that right now.\r\n\r\nBy the time this post goes live I will have gone through my backlog of posts and added in optional English translation for all non English strings. <!-- mixlang:レンジで:(even) if you prepare them with the microwave they'll be  -->good!", "tags": ["japanese", "programming", "website", "i18n/l10n"], "id": "801a3c9b", "date": "2018-03-16", "headline": "Mixed language content", "image": "mixed_language_content.jpg"}, {"text": "Month four — one thrid left; review:\r\n\r\nAnki ok. Sport insufficient. Here's the interesting stuff:  \r\n\r\n* general\r\n    * <!-- mixlang:餃子:gyōza (dumplings) --> and stuff from <!-- mixlang:オリジン:ORIGIN (bentō chain that also has a buffet) --> found their way into my food routine\r\n    * helped a crying little boy out in the street find his mum\r\n    * witnessed the following manifestation of cuteness:<br>3 small kids, two of them in bear costumes, waiting for the train with their mum<br>announcement for the next train to come in a few minutes: <!-- mixlang:「...。この電車は10両です。」:&quot;... . This train has 10 wagons.&quot; (wagons = &quot;ryō&quot;) --><br>kids: <!-- mixlang:「10秒？10！9！8！...」:&quot;10 seconds? 10! 9! 8! ...&quot; (seconds = &quot;byō&quot;) --><br>but there was no train when they reached 0. :'D \r\n    * was stopped by police for riding my bike at night without a light (mount is loose, I support it w/ rubber bands, that day the bands ripped on my way *to* work so I put they light in my bag); they were *extremely nice* — had a good chat\r\n    * got the [Dogen approved verification](https://youtu.be/oXLP6IGmdZs?t=1m4s) that my Japanese it about as good as that of a native first grader — was asked <!-- mixlang:「長いんですか？日本は」:&quot;So ... you&#39;ve been living in Japan for quite some time?&quot; --> by abovementioned policemen and the next day when getting my hair cut :3\r\n    * saw a performance of the <!-- mixlang:東京都立青梅総合高等学校 和太鼓部:Ome Sōgō High School taiko club --> which was awesome\r\n    * spent almost a week in Kyōto and two nights in Nagoya\r\n    * the local sentō had a \"chocolate bath\" (cacao butter mixed into the water) around valentine's day which was geat ^_^\r\n    * saw a few people from Matsuyama again while they were in Tōkyō  \r\n    * a bug I found\\* in Pokemon GO got [some coverage](static/img/blog/nii_add_06.jpg) by blogs/YouTube channels<br>following how the story spread from a dedicated subreddit to more and more general sites was quite interesting — especially low effort *\"news posts\"* that got things wrong were amusing<br>\\(*to be precise I found something that works on some devices and a fellow redditor found a variation that works on all devices)\r\n* at the institute\r\n    * the conceptual stuff I mentioned last time is finally done and got some good feedback\r\n    * was able to integrate learning a few neat new [Flask](http://flask.pocoo.org/) related things into my work\r\n    * stumbled upon a PhD thesis titled [The Presentation of Self on a Decentralised Web](https://github.com/rhiaro/thesis) — can I please take a week off from life and explore this?\r\n    * got into and am getting back out of eating dinner somewhere close to work to then head back and work some more\r\n    * the elevators say <!-- mixlang:「おはようございます」:&quot;Good morning&quot; --> at 8:26 a.m. — so maybe the interval is from 8 to 9?\r\n\r\nGood times. More.\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "1705b50f", "date": "2018-02-18", "headline": "国立情報学研究所〔四〕", "image": "nii_04.jpg"}, {"text": "Month three — halfway through; another review:\r\n\r\nAnki wasn't that great ([stats](static/img/blog/anki_stats_180118.png)) but at least still better than in the first month — and I finally got around doing some badly needed maintenance on my deck. Apart from Japanese study, slow but steady progress across the board. Nothing to complain. :)\r\n\r\nAgain, an attempt to convince myself that I'm actually making good use of my time here:  \r\n\r\n* general\r\n    * was at a sentō on christmas eve; on the way back I heard a girl's voice from a near high-rise building <!-- mixlang:「サンタ様ー！来てくださーい！」:&quot;Santa Claaaus! Please come to our hooouse!&quot; --> :3\r\n    * was shocked to learn that Japan introduced compulsory wearing of seat belts for rear passangers [in 2008](https://ja.wikipedia.org/wiki/%E3%82%B7%E3%83%BC%E3%83%88%E3%83%99%E3%83%AB%E3%83%88#%E5%BE%8C%E9%83%A8%E5%BA%A7%E5%B8%AD%E3%82%B7%E3%83%BC%E3%83%88%E3%83%99%E3%83%AB%E3%83%88%E7%BE%A9%E5%8B%99%E5%8C%96) *and there's no penalty for non expressway roads* °_°\r\n    * rode my bycicle to work, passed a <!-- mixlang:ママチャリ:mama-chari (bicycle type with front basket often used by mothers) --> and thought I heard a <!-- mixlang:「ウゥウゥウイッ！地震です！」:&quot;UuUuUi! Earthquake alarm!&quot; --> — but there was a kid on the back of the <!-- mixlang:ママチャリ:mama-chari --> gaming away on some handheld console so I could've misheard some game sounds. Stopped anyway to see what happens — nothing happened so I concluded it was some game. [Turned out it actually was an earthquake alarm](https://rocketnews24.com/2018/01/05/1004451/).\r\n    * saw the last Jedi\r\n    * was in Niigata\r\n    * had a very Japanese New Year with <!-- mixlang:紅白:Kōhaku -->, <!-- mixlang:年越しそば:koshi-toshi soba -->, <!-- mixlang:雑煮:zō-ni -->, <!-- mixlang:初詣:hatsumōde --> and <!-- mixlang:駅伝:ekiden --> — sneaked in a German tradition with [Dinner for One](http://www.spiegel.de/international/zeitgeist/dinner-for-who-germany-s-new-year-procedure-a-418781.html)\r\n    * watched the entire <!-- mixlang:かるた名人・クイーン戦:karuta master and queen championship --> live on <!-- mixlang:ニコ動:Nico Nico Dōga -->\r\n    * visited the <s>Tokyo</s> Saitama [flood prevention underground thingy](static/img/blog/nii_add_05.jpg)\r\n    * I'm finally getting back into sports after a 5 month break due to an injury\r\n* at the institute\r\n    * had a bit of fun with face recognition and line detection (OCR)\r\n    * doing a lot of very conceptual work at the moment\r\n    * the elevetors sometimes say <!-- mixlang:「お待たせしました」:&quot;Sorry for the wait&quot; --> and <!-- mixlang:「どうぞお乗りください」:&quot;Please enter&quot; -->\r\n\r\nAll in all, satisfactory. Oh and the constant feeling that I could/should do more is gone. (:\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "dcc5460c", "date": "2018-01-18", "headline": "国立情報学研究所〔三〕", "image": "nii_03.jpg"}, {"text": "Month two of only six this time; another review:\r\n\r\nI did better with Anki this month ([stats](static/img/blog/anki_stats_171218.png)); even managed to stoll through <!-- mixlang:神保町:Jinbōchō -->, grab a second hand book ([<!-- mixlang:日本語雑記帳:nihongozakkichō -->](https://www.amazon.co.jp/dp/4004313511)) and read from time to time. Still ... my deck needs some maintenance, I want to add more new vocab, read more, etc. I took part in events, explored new places and worked a bit on personal projects. Still ... I feel I could do more. Maybe being aware that there's *soo* much going on around me constantly, resutls in a fear of missing out on great chances. But it's not just that. Regardless of the specifics of what's going on around me, I'd like to do more — more than I currently can do with the limited amount of productive time per day. On the bright side, that's a least better than not knowing what to do with myself.\r\n\r\nAgain, a collection of noteworthy and/or random things:  \r\n\r\n* general\r\n    * the <!-- mixlang:漢字ミュージアム:kanji museum --> in Kyōto [is nice](static/img/blog/kanji_museum.jpg) — you can do mini <!-- mixlang:漢検:kanji aptitude test --> samples<br>(I seem to be able to pass <!-- mixlang:6級:level 6 (goes from 10 easiest to 1 impossible) --> and 5級, but 4級 and 3級 were so so)\r\n    * [<!-- mixlang:ゲームマーケット2017秋:Game Market 2017 Autumn -->](static/img/blog/game_market.jpg) had a real life Catan trading and in general was super fun\r\n    * [Agricola](https://en.wikipedia.org/wiki/Agricola_(board_game)) seems to be popular among board game enthusiasts here<br>(a local meetup I attended was almost exclusively Agricola, played one round)\r\n    * at <!-- mixlang:ポタフェス2017:Portable Audio Festival 2017 --> I was able to experience the [Sennheiser HE 1](http://sennheiser.com/sennheiser-he-1)<br>(kind of ... didn't have the time to really choose music, was in a noisy environment, etc.)\r\n    * [Open Space 2017](http://www.ntticc.or.jp/en/exhibitions/2017/open-space-2017-re-envisioning-the-future/) at the NTT ICC [was good fun](static/img/blog/open_space.jpg)\r\n    * [CJK Unicode shenanigans](https://github.com/IllDepence/goyoukumimoji)\r\n* at the institute\r\n    * wrote a small flask web application that is now used in production, hosted by the NII\r\n    * the elevators don't say <!-- mixlang:「本日はご苦労様でした」:&quot;Thank you for your hard work today&quot; --> when you get out way after 5 p.m.\r\n    * the elevators say <!-- mixlang:「おはようございます」:&quot;Good morning&quot; --> at 8:50 a.m. — need further data to estimate a time frame for that\r\n    * attended [NTCIR 13](http://research.nii.ac.jp/ntcir/ntcir-13/) sporadically; chatted with some Yahoo! guys\r\n\r\nAll in all, a lot of good stuff. But MOAR WANT. TOO MUCH WANT.\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "ef5d4cd2", "date": "2017-12-18", "headline": "国立情報学研究所〔二〕", "image": "nii_02.jpg"}, {"text": "&gt; [On to the ... <span style=\"text-decoration: line-through;\">oh wait. :(</spann>](?a=17d61d5b)  \r\nNEXT MONTH!\r\n\r\nI'm back to Japan. First month passed. Assembling the bits and pieces of a functioning everyday life. :)  \r\nRegister as a resident, set up a bank account, get a bicycle, find a supermarket to frequent, get a feeling for monthly costs and how much you can spend on what, connect with new people, ... I have the feeling I'm almost set up. One of the few things I have yet to manage is get into a stable Anki routine. I've been powering through over 300 cards today to finally get back to 0 after a meager 14/30 days studied since I arrived.\r\n\r\nA collection of noteworthy and/or random things:  \r\n\r\n* general\r\n    * [here's where I spent my time](static/img/blog/nii_add_00_heatmap_h.jpg)\\*, and because that's not saying much [here's a closer look at Tokyo](static/img/blog/nii_add_01_heatmap_t.jpg)\\*<br>(\\*it's actually the places where I had a wifi connection or [was using Goole maps](https://github.com/theopolisme/location-history-visualizer))\r\n    * at times I felt like a student that just moved out of mom's and has to figure out how the world works again (googling where to buy stuff, how to cook stuff, etc.)\r\n    * Halloween at <!-- mixlang:渋谷:Shibuya --> [was cazy](static/img/blog/nii_add_03.jpg)\r\n    * I visited the <!-- mixlang:印刷博物館:Printing Museum --> and got to [print *sirtetris* with movable type](static/img/blog/nii_add_04.jpg) (also see image above)\r\n    * folks at the share house are nice :)\r\n* at the institute\r\n    * the day after my arrival I got my scholarship for several months in cash. Having the equivalent of about 4.5k € in cash lying around made me kind of paranoid and sped up the process of me getting a bank account.\r\n    * Mac and Windows users are required to install Sophos Anti Virus. Linux users are left in peace :3\r\n    * overhearing other grad students talk about and plan their \"first time in Japan\" adventures is entertaining\r\n    * the elevators say <!-- mixlang:「本日はご苦労様でした」:&quot;Thank you for your hard work today&quot; --> when you get out on the first floor after 5 p.m.\r\n    * cafeteria lunch [is tasty](static/img/blog/nii_add_02.jpg)\r\n\r\nAll in all, I'm quite satisfied. The only thing that kind of bothers me is the lack of any easily quantifiable progress with my Japanese. I pick up and write down new words and phrases, but constantly being behind with my Anki studies prevented me from integrating them into my deck. Oh and also ... my Kindle app won't let me log into my German account so I can't access the Japanese book I was reading back in Germany. -.-\r\n\r\nAnyway, the few things to complain about are *mostly harmless*, soo ...\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "e3b2107a", "date": "2017-11-18", "headline": "国立情報学研究所〔一〕", "image": "nii_01.jpg"}, {"text": "About a year ago I [came back to Germany](?a=17d61d5b) after spending [one year in Japan](?t=MYJ15). Now I'm going again — for six months. :)\r\n\r\nLast time I went as an exchange student. This time I got into an internship program for Ph.D. and Master students at the [National Institute of Informatics](http://nii.ac.jp/). — i.e. this time I'm actually doing something related to my studies <sup style=\"font-size: 0.5em;\">(my exchange university last time had no computer science courses)</sup>.\r\n\r\nAnother major difference is that this time I had to organize accommodation by myself. Find a place to live in Tokyo — what a nice ex ante adventure, yay ᕕ( ᐛ )ᕗ. What I knew from the beginning is that I would search for a room in a share house. I had previously made good experiences with share houses in Japan, knew that it would be cheaper, save me the hassle of having to buy a gazillion every day life items for just half a year and get rid of them afterwards, and knowing that I might end up speaking primarily English at work, a share house with Japanese people would up my chances of having extended conversations in Japanese on a daily basis.  \r\nSo, I started searching on [roomshare.jp](http://roomshare.jp/) and [roommate.jp](http://roommate.jp/), took a brief glimpse at non-shared flats on [<!-- mixlang:グッドマンスリー:Guddomansurii -->](http://www.good-monthly.com/) only to be scared away by the prices, and finally found something at [<!-- mixlang:ひつじ不動産:Hitsujifudōsan -->](https://www.hituji.jp/). Given what I wanted — something not too far from work, not too expensive, where I could let someone stay at my place for a night or two, where thery're okay with someone who's guaranteed to leave after 6 months and on top of all that where a foreigner is able to sign a contract without a Japanese guarantor — I'm *super* happy with the place I found. :)  \r\nAdditionally the countless mails back and forth until I found the place, the deal was sealed and all the details were discussed were *quite* the <!-- mixlang:敬語:Keigo (polite language) --> boot camp. orz\r\n\r\nAnyway, preparations are as good as done. Journey starts Oct 17<sup>th</sup>. Updates will be tagged [#NII17](?t=NII17). :)", "tags": ["japanese", "travel", "education", "programming", "research", "NII17"], "id": "b63072f8", "date": "2017-09-26", "headline": "Six months at the 国立情報学研究所", "image": "nii_00.jpg"}, {"text": "The computer science exams I take usually heavily rely on *understanding*. Learning for those exams means doing tasks that require applying the knowledge acquired. Memorizing facts almost never plays a big role. Quite a few exams are even *\"open book\"* — bring as much non digital material as you want.\r\n\r\nLast semester I took two psychology classes with exams that were more or less the opposite. Being used to memorize stuff (kanji) with Anki, I thought it might be most efficient to use it for exam preparation. Because I was curious how much time I'd spend I recorded the whole process. Here's how to pass a 5th semester psychology class (*Occupational and Organizational Psychology*) as a CS major:\r\n\r\n**The challenge**  \r\nThe lecture consists of 386 slides. The exam can be passed with a very good grade solely based on the information given on the slides plus what is being said during the lecture, but students are advised to also look into referenced books and papers (I didn't). The exam consists of (iirc) 50 multiple choice questions, each of which has 5 answers of which between 0 and 5 are correct. Choosing a correct answer or not choosing a wrong answer results in 1 point. Not choosing a correct answer or choosing a wrong answer results in -1 point. The overall points for one question are reset to 0 in case they're negative. Example questions given for the exams go as deep as asking for names of authors or effect sizes of specific studies.\r\n\r\n**The solution**  \r\n\r\n* Attend all the lectures, annotate the slides (yellow boxes in the image above)\r\n* Start preparing for the exam about 3 weeks in advance, within these 3 weeks:\r\n* Spend a total of 14 hours to write a summary of the lecture's content (25 pages)\r\n* Spend a total of 9 hours to create Anki cards (477 cards)\r\n* Spend a total of 12 hours reviewing these Anki cards (2775 reviews)\r\n* Squeeze in 5 days of preparation for another exam with less material to learn\r\n* Pass with a <span title=\"2.7\">not so great result</span>, having spent a total of 35 hours on exam preparation (not counting lecture attendance)\r\n\r\n→ [Anki stats](static/img/blog/anki-stats-aopsycho_2017-02-16.png)", "date": "2017-04-14", "headline": "Anki for exams", "tags": ["education", "time"], "id": "8c0f44ca", "image": "aopsycho.jpg"}, {"text": "I recently stumbled upon xkcd's comic on the idea of a [28-Hour Day](https://xkcd.com/320/). Having been interested in polyphasic sleep for a long time (without ever trying) and this being similar, I checked whether or not it would work out with my current situation of temporally fixed obligations throughout the week. Turned out that there would be [very little overlap](static/img/blog/sleep_28_plan.jpg) (blue=sleep, green=obligation). And the two cases where a lecture falls at the very end of a day ... just schedule two/three hours of sleep before that, right?\r\n\r\nWrong. Instead of extending my day by 4 hours per sleep/wake cycle I ended up with 3.5, 0.5, 2.5 ... -6. Friday, 1:30 a.m. I was super tired after having been awake for a mere 7 hours, went to bed and slept for 8 hours straight. [This is how the whole week turned out](static/img/blog/sleep_28_turnout.jpg). More like a rubber band that I stretched a bit than the intended wrapping around over the course of a week.\r\n\r\nLesson learned: if you sleep a lot anyways (8-9 hours per night in my case), the 28 hour day may not be for you. ^_^", "date": "2016-12-18", "headline": "28 hour day", "tags": ["self-reflection", "libertine", "time"], "id": "33c61718", "image": "sleep_28.jpg"}, {"text": "99 kanji, 575 words, 489 days; [Anki stats](static/img/blog/anki_stats_161212.png), [kanji so far](static/dl/kanji_checkpoint_20).\r\n\r\nWhew... Haven't done one of these in a loong time. Who would've tought I'd actually reach 2000 ... In my first kanji progress post, [100+](?a=e61bc488), I wrote “*there will — hopefully — be a total of 21 of these in the end*” — I'm really not sure I'll ever get to 2100. Since realizing at [1800+](?a=bd733663) that new kanji as a main focus isn't worth it anymore, it took me 115 days to get the first 100 on top of that and now 489 days for the second. If factor of increase in time stayed the same I'd reach 2100 in August 2022. ^_^  \r\nQuite the deviation from my extrapolations at [1000+](?a=62f53ec0), where I took a closer look at what I had leared so far. Here's the same thing for the present situation:\r\n\r\nAdditional data:&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[values from 1000+]</span>\r\n\r\n#### Grades\r\n* Grade 1: 80  of 80  (100.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[100.0%]</span>\r\n* Grade 2: 160 of 160 (100.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[100.0%]</span>\r\n* Grade 3: 200 of 200 (100.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[88.0%]</span>\r\n* Grade 4: 200 of 200 (100.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[64.0%]</span>\r\n* Grade 5: 185 of 185 (100.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[55.1%]</span>\r\n* Grade 6: 178 of 181 (98.3%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[51.4%]</span>\r\n* JuniorHS: 775 of 934 (83.0%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[21.6%]</span>\r\n\r\n\r\n#### Distribution\r\n* 2000 total unique kanji&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[1002]</span>\r\n* Jōyō: 1910 of 2136 (89.4%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[45.7%]</span>\r\n* Jinmeiyō (regular): 66 of 641 (10.3%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[3.1%]</span>\r\n* Jinmeiyō (variant): 1 of 145 (0.7%)&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[0%]</span>\r\n* 23 non-jōyō kanji&emsp;&emsp;&emsp;<span style=\"color:#bbb\">[5]</span>\r\n\r\n", "date": "2016-12-11", "headline": "漢字 — 2000+", "tags": ["japanese", "kanji"], "id": "1f099c17", "image": "kanji_checkpoint_20.gif"}, {"text": "Ever since I came back from Japan I've been on the lookout for fun projects in which I could utilize my Japanese. Recently I stumbled upon *Ubunchu!*, a manga about Ubuntu. Created by [Hiroshi Seo](http://www.aerialline.com/) and published in [Ubuntu Magazine Japan](http://ubuntu.asciimw.jp/), there seem to be 14 chapters of which only the [first 8](http://divajutta.com/doctormo/ubunchu/) have been translated so far. Given publishing stopped in 2013 and the [Google Group](https://groups.google.com/forum/#!forum/ubunchu-translators) dedicated to translating the manga has seen no activity in 6 months it seemed like a worthwhile project to pick up.\r\n\r\nSince the [illustrator's website](http://www.aerialline.com/comics/ubunchu/) offers source files (at least for chapters 1-11) there's almost no cleaning or redrawing necessary. To make up for the lack of challenge, chapter 9 — which I started with — included a bunch of BL lingo which was \"great fun\" to research and \"translate\" as well as Revolutionary Girl Utena references I probably missed most of.\r\n\r\nI'm not yet sure whether I'll just create one blog post per chapter or add something to the projects section. In case of the latter I'll add some note to this post. Regardless of that there's also a [Git repository](https://github.com/IllDepence/ubunchu-translation). And here's the first chapter:\r\n\r\n### Ubunchu! chapter 9: Revolutionary IME Kaname\r\n* [PDF document](static/dl/ubunchu_09.pdf)\r\n* [ZIP folder](static/dl/ubunchu_09.zip)\r\n\r\n‌‌  \r\n/edit[2017-09-26]: Whoops. So ... I didn't touch this for about a year or so. But in the last 3 days I did chapter 10! ;)\r\n\r\n### Ubunchu! chapter 10: Outbreak of an interface war!?\r\n* [PDF document](static/dl/ubunchu_10.pdf)\r\n* [ZIP folder](static/dl/ubunchu_10.zip)\r\n\r\n‌‌  \r\n/edit[2018-05-04]: The stars aligned for chapter 11! A friend of mine recently started translating manga, so I had the topic on my mind. Also there's been a little activity in the Ubunchu Google Group and I stumbled upon one of my translations on a online manga reader website, so I felt there's people that care about the manga. Lastly, it's [golden week](https://en.wikipedia.org/wiki/Golden_Week_%28Japan%29), so I had some free time on my hands.\r\n\r\n### Ubunchu! chapter 11: My lady is fond of her old butler!?\r\n* [PDF document](static/dl/ubunchu_11.pdf)\r\n* [ZIP folder](static/dl/ubunchu_11.zip)\r\n\r\n‌‌  \r\n/edit[2019-07-17]: Starting with chapter 12 there's no source files any more. Keeping up with the one chapter per year pace, I translated chapter 12 (actually finished translating it—had done the first third last year already), but I don't see myself finding the time to do cleaning and typesetting.\r\n\r\n### Ubunchu! chapter 12: Rule of a sister distro! Mint-chan\r\n* [Translation file](https://gitlab.com/sirtetris/ubunchu-translation/blob/master/chapter12.mtl)\r\n* [Cover page](https://gitlab.com/sirtetris/ubunchu-translation/raw/master/ch12_files/jpg/page0001.jpg)\r\n\r\n‌‌  \r\nHave fun reading. ;)", "tags": ["japanese", "linux", "manga", "translation"], "id": "d932debd", "date": "2016-10-20", "headline": "Translating manga", "image": "ubunchu.jpg"}, {"text": "One year in Japan; a last review:\r\n\r\nMy last month in Japan began during a trip to Tokyo. I couchsurfed again and had 3 awesome hosts over 8 days. I went to Ueno park several times because of the ridiculous [Pokemon Go situtaion](static/img/blog/myj15_add18.jpg), climed [Mt. Fuji](static/img/blog/myj15_add20.jpg) ([great view from the top](static/img/blog/myj15_add22.jpg), also a [gym at station 9](static/img/blog/myj15_add21.jpg)), hung around with two [Taiwanese friends](static/img/blog/myj15_add19.jpg), went to [Enoshima](static/img/blog/myj15_add23.jpg) and attended [Comiket](static/img/blog/myj15_add24.jpg).  \r\nThe last 3 weeks I lived in a share house, did some translation/localization work as an alternative to paying rent and continued the series of farewell events and meetups. I also finally got my JLPT N2 result. Passed with a score of 140/180. :)\r\n\r\nLooking back at the year as a whole: *very* much worth it. Set out to improve my Japanese, did just that and made a bunch of good memories. As for Japan, the pros (respectful people, safe, fascinating contemporary and ancient culture, no tipping, ...) outweigh the cons (vacuous positivity, non-existent insulation of buildings, overdone collectivism, pricy, ...) for me. I'll definitely go again some time.\r\n\r\nOn to the ... oh wait. :(", "date": "2016-09-08", "headline": "松山大学〔十二〕", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "17d61d5b", "image": "myj15_12.jpg"}, {"text": "Eleven months in Japan; another review:\r\n\r\nAfter a packed month 9 and a calm month 10 it's back to busy again — in a good way though. :)\r\n\r\nThe semester ended with Japanese exams I took, German exams I helped out with and a lot of farewell events. This was accompanied by preparations for and the start of my trip to Tokyo and ... lo and behold ... the release of Pokémon Go in Japan.  \r\nUp until one and a half weeks ago my smartphone setup consisted of a Samsung I9000 without SIM card running CyanogenMod 11. With some Linux trickery I managed to get the app to start but it was super unstable and unplayably slow. As a consequence I bought a new phone (Asus T00P), caught Pokémon within Matsuyama's extensive areas of public Wifi for some time and now got a data SIM card for the last month.\r\n\r\nAs of the 8th I'm actually in the midst of my side trip to Mt. Fuji, but I'll put the Tokyo trip as a whole into the next review. \r\n\r\nOn to the last month!", "date": "2016-08-08", "headline": "松山大学〔十一〕", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "cfe63e61", "image": "myj15_11.jpg"}, {"text": "Ten months in Japan; another review:\r\n\r\nI don't have the feeling a whole lot happened. Neither does it feel like it's been a month.\r\n\r\nMaybe my [brain just melted](static/img/blog/myj15_add17.jpg).\r\n\r\nIn any case; the end of the semester is coming closer, and with it deadlines for reports, projects and the like. That kept me busy. I also took my first JLPT — N2, went okay, results in early September. Preparations for my last month are also going smoothly. I'll be travelling for about a week (Mt. Fuji, Tokyo, Comiket) and have a work for accommodation arrangement for the remaining time after that.\r\n\r\nAll in all, everything progressing nicely. Nothing really to complain.\r\n\r\nOn to the next month!", "date": "2016-07-08", "headline": "松山大学〔十〕", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "743d35da", "image": "myj15_10.jpg"}, {"text": "Nine months in Japan; another review:\r\n\r\nLooking back at what happened since the last review I wondered ... did I forget to post once?  \r\nApparently I didn't. During the last 31 days:\r\n\r\n* A friend from Germany got hospitalized during his visit to Matsuyama, which led to me being Japanese/German interpreter for about a week. I spent a night in the intensive care unit, got to see all kinds of fancy medical machinery at work — interesting stuff.\r\n* I got to know new people working with guest houses in Matsuyama and participated in a pilgrimage event ([#52+53](https://en.wikipedia.org/wiki/Shikoku_Pilgrimage)) organized by the aforementioned.\r\n* Spent some quality time with friends and went out more that usual.\r\n* Formed a nice group with people from the game development seminar I take part in. Since I'm *\"the guy with the programming experience\"* I introduced the rest of the group to Git, Lua and [LÖVE](http://love2d.org/) (the framework we agreed on using). Experiencing how Japanese approach group work and especially decision making is quite fascinating.\r\n* Established new connections to a few exchange students. (I used to focus on spending time with Japanese.)\r\n* Established new connections to a few Japanese (potential tandem language learning parnter, people interested in intercultural exchange, etc.).\r\n* Did some indoor bouldering which I hadn't done in ... maybe a year or so.\r\n* Gave a presentation about Germany at a local elementary school.\r\n* Went to see [fireflies](static/img/blog/myj15_add16.gif) on a whim one night.\r\n* Started preparations for my last month in Japan (during which I won't stay in the university's dorm) which meant getting a working permission, establishing some connections for potential daywork etc.\r\n\r\nAll alongside the usual university stuff. Well ... no signs of overload yet. And therefore:\r\n\r\nOn to the next month!", "date": "2016-06-08", "headline": "松山大学〔九〕", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "57677323", "image": "myj15_9.jpg"}, {"text": "Eight months in Japan; another review:\r\n\r\nThe new semester started. This time I take 4 Japanese classes (reading, discussion, practical appilcation, business) as well as one grad school class on intercultural communication and an undergrad seminar on game development. While the latter is targeted at total beginners and therefore not *that* interesting for me content wise, it *is* Japanese targeted at Japanese and therefore super useful listening practice.\r\n\r\nApart from lectures there's a steady flow of events, activities, occurrences that keeps me busy and happy. I participated in [Ludum Dare 35](https://youtu.be/XLC6Lz0eKt4), did some English language instruciton/training at a local NGO, started [speed cubing](https://youtu.be/AI63Md4cZCE) again — at least for a day ^^ —,  helped [flying a kite](static/img/blog/myj15_add14.gif) at a [kite flying festival](static/img/blog/myj15_add15.jpg), etc. etc.\r\n\r\nSide note: the two JK energetically playing a huge taiko was the best thing ever (see title image, also taken at the kite festival).\r\n\r\nGood stuff.\r\n\r\nOn to the next month!", "date": "2016-05-08", "headline": "松山大学〔八〕", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "d095691b", "image": "myj15_8.jpg"}, {"text": "Seven months in Japan; another review:\r\n\r\nAs I predicted in my [previous post](?a=8a4429e5) I enjoyed an extensive downtime to recharge. :) No traveling, no big events, just lazy day-to-day life. Coming monday lectures will start again; leaving me with less free time, but more externally enforced structure.\r\n\r\nIn any case, the trip I was in the midst of last post ended without any trouble and was definitely worth it. Good experiences, nice memories and I was able to tick off some new prefectures in the [projects section](?c=projects) (never underestimate the motivational power of lists ^_^').\r\n\r\nIn the time after the trip occupied myself with [geocaching](static/img/blog/myj15_add13.jpg), parkour training, meeting friends and making new acquaintances. I also felt the desire to do something techy again. After about 4 months of “abstinence“ I tinkered a bit with my [anilist client](https://github.com/IllDepence/anihilist), [peaked](https://github.com/IllDepence/polyglots/tree/master/160403-selfdoc) into the realm of [polyglots](https://en.wikipedia.org/wiki/Polyglot_%28computing%29), — and also aside from tech I invested some time in areas of interest where it seemed long overdue. I guess I kind of dialed down the feeling guilty whenever I sink time into stuff that isn't in any way helping with my Japanese. Good thing. \r\n\r\nOn to the next month!", "date": "2016-04-08", "headline": "松山大学〔七〕", "tags": ["japanese", "travel", "education", "MYJ15", "programming"], "id": "3c5d3783", "image": "myj15_7.jpg"}, {"text": "Six months in Japan; another review:\r\n\r\nMore or less a month ago I had my last exams for the winter semester; and the summer semester won't start until early April. What this means is that I have a lot of free time. :)\r\n\r\nI've started to watch a lot of <!-- mixlang:ドラマ:non animated Japanese TV series --> and am currently in the midst of [previously mentioned](?a=80c729ee) train trip along Osaka, Nagoya, Tokyo, Kyoto. For accommodation I decided to give couchsurfing a try (except for one night in a capsule hotel). So far it's been great — but I get the feeling that a 10 day trip with 5 different hosts is on the edge between 'fun to meet new people' and 'kind of exhausting'. :D\r\n\r\nAfter the trip I'm expecting to have some extensive downtime to recharge. ^_^'\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "8a4429e5", "date": "2016-03-08", "headline": "松山大学〔六〕", "image": "myj15_6.jpg"}, {"text": "Five months in Japan; another review:\r\n\r\nCan *to kindle* be used intransitively? If not there's some creativity required to interpret this month's subtitle.\r\n\r\nOver the course of the past month two particular types of activities made me come to a pleasant realization. I made a few new acquaintances — people with whom I met and had prolonged conversations; and I was on the lookout for a Japanese online forum/​message board with decent activity as well as conversations on topics I'm interested in. The realization I arrived at is, that I am at a point where using Japanese finally starts not being a pain in the ass anymore.  \r\nI had passable conversations in Japanese that were way more pleasant and functional than chore-like and apparently necessary for practice's sake. And after leaving <!-- mixlang:２ちゃんねる:2channel (the Japanese 4chan) --> aside for the moment and trying out <!-- mixlang:知恵袋:Chiebukuro (a Q&A site) --> I found an online platform that turns out to be easy to contribute to.  \r\nWhen I leaned English, being able to take part in written discussions online was an important tipping point. Once possible without too much hassle (i.e. as soon as it was more about the content of the discussions than about the language they were held in) my active use of the language and with that my proficiency skyrocketed. I could image I just hit that tipping point with Japanese, kindling a small flame that may, in the foreseeable future, turn into a raging [wildfire](static/img/blog/myj15_add12.jpg).\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "54bb3b9f", "date": "2016-02-08", "headline": "松山大学〔五〕", "image": "myj15_5.jpg"}, {"text": "Four months in Japan; another review:\r\n\r\nTurned out I [hit the breaks](?a=dcfa4ea5) early enough — no overload in terms of events. :)<br>\r\nLectures just started again after a short break around New Year, a friend visited for two weeks, and all in all things are good. :) I attend regular club meetings (<!-- mixlang:部会:bukai -->), get to know new people from time to time,  make new experiences ... oh and after living here for 4 months I *just* found out that at the public university (right next to the private one I actually go to — but I take lectures at the public one too) the canteen is opened on Saturdays. I missed out on 17 easy lunches since September just because it did not occur to me to check their canteen schedule.\r\n\r\nIn other news: the semester break is getting close. Not yet sure what I'll do in February. March is most likely to be spent travelling with JR's <!-- mixlang:青春18きっぷ:Seishun 18 Ticket --> (unless I find an even more cost efficient way). In any case:\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "80c729ee", "date": "2016-01-08", "headline": "松山大学〔四〕", "image": "myj15_4.jpg"}, {"text": "Three months in Japan; another review:\r\n\r\nJapan: Join ALL the events!<br>\r\nTarek: No!<br>\r\nI think I did well in building upon my [solid base](?a=05755303) during the last month. As events recently had the tendency to lead to invitations to even more events, I had to start — and have to continue — to refrain from trying to grab every opportunity that is comfortably laid out in front of me. Doing new and exciting and challenging stuff is awesome, but in my case those things tend to require preparation and engery. Agree to participating in too much stuff and you'll end up exhausted, not meeing the expectations of yourself and others and having a stressful time. I think I've realized that just early enough to not end up super stressed — we'll see what I have to report in early January (which just falls short of the time up to which things I've agreed to participate in extend to as of now).\r\n\r\nA few highlights: gave a presentation in front of middle school students, went on my first self-organized trip (2 days Hiroshima) and am on the brink of finally starting regular club activities (<!-- mixlang:部活:bukatsu -->).  \r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "MYJ15", "food"], "id": "dcfa4ea5", "date": "2015-12-08", "headline": "松山大学〔三〕", "image": "myj15_3.jpg"}, {"text": "Two months in Japan; another review:\r\n\r\nI feel like I've reached a solid base on which to build upon in a lot of aspects. After selling my DSLR prior to coming to Japan in order to switch to a more portable system I finally bought a [new camera](static/img/blog/myj15_add6.jpg). I've received my first scholarship money resulting in me financially operating from my Japanese bank account instead of my German credit card. A larger project which is part of my master's course at the University of Freiburg is finally finished leaving me with more free time. I've kind of sort of developed a food routine or rotation of different foods for mornings and evenings. And probably most important of all: social connections start to feel real. The <!-- mixlang:体操部:taisōbu --> (gymnastics club) people are happy each time I join their training, the [boardgames](static/img/blog/myj15_add9.jpg) meeting I've attended once so far looks promising and tandem language learning is fun as always. :)\r\n\r\nA few random highlights: I ate [whale meat](static/img/blog/myj15_add8.jpg), managed to corrupt my Ubuntu system and had to [set up a new one](static/img/blog/myj15_add7.jpg), had fun at [Halloween](static/img/blog/myj15_add10.jpg), am getting into Geocaching and competed at a [settlers of catan tournament](static/img/blog/myj15_add11.jpg). All in all, a bunch of positive developments.\r\n\r\nOn to the next month!", "tags": ["japanese", "travel", "education", "MYJ15", "food"], "id": "05755303", "date": "2015-11-04", "headline": "松山大学〔二〕", "image": "myj15_2.jpg"}, {"text": "One month since I've arrived in Japan; short review:\r\n\r\n**Fun with power plug adapters**  \r\nAC plugs and sockets used in Germany are [IEC](http://www.iec.ch/worldplugs/) types F ([“Schuko“](https://en.wikipedia.org/wiki/Schuko)) and C ([“Europlug“](https://en.wikipedia.org/wiki/Europlug)), Japan uses types A and B — but actually almost excusively A. Now, if you own a device with a type F plug (let's say, a laptop) and want to get an adapter for type A sockets, *don't even bother looking*. F→B and C→A adapters are readily available, and because A plugs also work with B sockets, C→B is unnecessary. But since F plugs are earthed and A plugs are not ... no F→A adapters. And for the same reason you also can not find F→C adapters to build a funny F→C→A adapter parade.  \r\nThe only option you're left with (to my best knowledge) for plugging in a laptop from Germany to a power socket in Japan, is to find a C→A adapter with unnecessarily large pin holes (type C plugs have 4 mm pins whereas type F plugs have 4.8 mm pins), remove anything put into place to *stop* people from forcing F plugs into the adapter and then do exactly that. [Here's my take](static/img/blog/myj15_add0.jpg), on the unavailability of F→A and F→C adapters.\r\n\r\n**University**  \r\n- *Classes* are interesting. I take 4 Japanese classes (essay writing<sup>[1]</sup>, reading skills<sup>[2][3][4]</sup>, mixed<sup>[5][6]</sup>, oral communication) as well as 3 grad school classes (linguistics<sup>[7]</sup>, sociolinguistics<sup>[8]</sup>, intercultural communication: the Japanese experience<sup>[9][10][11][12][13][14][15]</sup>).  \r\n- The *dorm* is nice. Rooms are spacious, everything you'd need in terms of appliances and so on is present, people are nice — I'm the only European; actually I'm the only one that is not from either China, Taiwan or South Korea. :D  \r\n- I'm also happy with the *canteen*. Food tastes good and thus far a meal cost me ￥ 465 (3.45 €) on average.  \r\n- *Staff* and people in general are super helpful and friendly.  \r\n- *Clubs* (<!-- mixlang:部活:bukatsu -->) are still kind of on my todo list. Visited two, but was too busy until now to look at more and/or join in on regular activities.   \r\nA difference to my previous experience with German universities, and actually a thing I'm not super happy with (though that's just a matter of taste), is the fact that the intended way of getting something done that may not be everyday business seems to be to go to a person in charge of that thing and ask them to take care of it. What I'm used to is informing myself and doing stuff on my own. Where I'm used to finding a guide for how to do something on a university's website I'm now finding a telephone number or description to which office I need to go. Same goes for information I would have expected to be readily available online (like e-mail addresses of professors). I'm curious whether or not I will, over time, get used to this default way of doing things. Or if I just misjudge the situation right now and all the university related exchange student setup procedures just were really out of the ordinary requiring an unusual amount of “office hopping“. \r\n\r\n**Life**  \r\nIn the first weeks I've been [exploring the city](static/img/blog/myj15_add1.gif) on my [“mamachari“](static/img/blog/myj15_add2.jpg) quite a bit. Initially I was focussing on traditional stuff like [shrines](static/img/blog/myj15_add3.jpg), [temples](static/img/blog/myj15_add4.jpg) and [onsen](static/img/blog/myj15_add5.jpg). At the moment I'm more likely to look for either something recreational like public parks and sports facilities or utility oriented places like supermarkets.  \r\nWhat I've yet to find is a few cheap and healthy “base foods“ for the evening and especially morning. In Germany that used to be [muesli](https://en.wikipedia.org/wiki/Muesli), bananas, whole-grain bread with cheese ... most of which is pretty much non-existent here.  \r\nI'm okay with rice+<!-- mixlang:ふりかけ:furikake (rice seasoning) --> and a small side dish, but cooking rice takes time. I've tried working with tofu, but haven't found an easy and quick way to make it tasty yet. What I'm pretty happy with are instant noodles. :D But I'd prefer something healthier.  \r\n\r\nAll in all, I'm happy with my current situation. :) As mentioned in my [previous post](?a=047d4541) I was curious how much different it would be ... never having lived more than 100 km away from where I grew up, suddenly living over 9,000 (not even intended, it's 9,358) km away ... turns out if you're used to living in a student dorm in a city in Germany and move to a student dorm in a city in Japan, it's really no big difference. (I guess if I'm honest with myself I wish it were a bit more different. ^^)\r\n\r\nIn any case, I'm in a position where I can experience a foreign country by as little as stepping outside the front door and I've got plenty of opportunity to use and improve my Japanese. That's awesome! On to the next month!  \r\n‌  \r\n\r\n---\r\n\r\n<p style=\"font-size: 10px; font-family: monospace;\">&nbsp;[1] 大学・大学院留学生の日本語（4）論文作成編　(アルク)<br>\r\n&nbsp;[2] 中・上級者のための速読の日本語　(The Japan Times)<br>\r\n&nbsp;[3] 大学・大学院留学生の日本語（1）読解編　(アルク)<br>\r\n&nbsp;[4] 中上級学習者のための日本語読解ワークブック　(アルク)<br>\r\n&nbsp;[5] 読む力 中級　(くろしお出版)<br>\r\n&nbsp;[6] 留学生のためのここが大切文章表現のルール　(スリーエーネットワーク)<br>\r\n&nbsp;[7] An Introduction to Cognitive Linguistics　(Routledge)<br>\r\n&nbsp;[8] An Introduction to Sociolinguistics　(Longman)<br>\r\n&nbsp;[9] The Japanese Mind　(Tuttle Publishing)<br>\r\n[10] With Respect to the Japanese: Going to Work in Japan　(Intercultural Press)<br>\r\n[11] Japanese Minorities: The Illusion of Homogeneity　(Routledge)<br>\r\n[12] The Other Japan: Voices Beyond the Mainstream　(Fulcrum Publishing)<br>\r\n[13] Diversity in Japanese Culture and Language　(Routledge)<br>\r\n[14] Multi-Ethnic Japan　(Harvard University Press)<br>\r\n[15] Japanese Culture and Communication: Critical Cultural Analysis　(University Press of America)</p>", "tags": ["japanese", "travel", "education", "MYJ15", "hardware", "rant", "food"], "id": "6a79349c", "date": "2015-10-08", "headline": "松山大学〔一〕", "image": "myj15_1.jpg"}, {"text": "Three to four years ago I gradually developed an interest in Japanese culture. Two and a half years ago I [started](?a=72ecfbb4) [learning Japanese](?t=japanese). One year ago I got in touch with the [University of Freiburg](https://www.uni-freiburg.de/) regarding the possibility of studying abroad in Japan. Now, after two semesters in Freiburg, I'm about to start a year at [<!-- mixlang:松山大学:Matsuyama University -->](https://www.matsuyama-u.ac.jp/) as an exchange student.\r\n\r\nI've never lived or studied [outside of Baden-Württemberg](static/img/blog/edu.webm), so I'm really excited about how such an amount of change will affect me. I'm also super hyped that I will finally be able to invest pretty much [ALL MY TIME](static/img/blog/jp_timeline.png) into improving my language skills. So far I always had to fit language learning somewhere inbetween while my bachelor's or master's degree were the quasi obligatory main thing.\r\n\r\nPreparations are as good as done. Journey starts Sep 8<sup>th</sup>. Updates will be tagged [#MYJ15](?t=MYJ15). :)", "tags": ["japanese", "travel", "education", "MYJ15"], "id": "047d4541", "date": "2015-08-31", "headline": "A year at 松山大学", "image": "matsuyama.jpg"}, {"text": "100 kanji, 420 words, 115 days; [Anki stats](static/img/blog/anki_stats_150811.png), [kanji so far](static/dl/kanji_checkpoint_19).\r\n\r\nFinal spurt? Not really. Apart from the last two weeks — where I actively searched for new kanji to get from 1880 to 1900 — considerations of [previous checkpoint](?a=bd733663) were put into practice. I got most of my newly acquired vocab from <!-- mixlang:ドラマ:non animated Japanese TV series -->, manga and interaction with Japanese people.\r\n\r\nIf I kept my current kanji pace I'd reach full Jōyō somewhere in the second quarter of next year. :D We'll see ... kanji isn't the main focus of active progression anymore.", "tags": ["japanese", "kanji"], "id": "ceb039a3", "date": "2015-08-11", "headline": "漢字 — 1900+", "image": "kanji_checkpoint_19.gif"}, {"text": "101 kanji, 231 words, 36 days; [Anki stats](static/img/blog/anki_stats_150418.png), [kanji so far](static/dl/kanji_checkpoint_18).\r\n\r\nLess than 45 days was doable. :)\r\n\r\nI'm considering to stop seaching for new kanji/vocab each day and repurpose that time for focussed reading practice, collecting new kanji/vocab on the way. This would, I expect, slow down my kanji progress significantly. But I feel that I've reached a point where the hassle of blindly seaching for new words to learn, solely for the purpose of getting those damn <!-- mixlang:常用漢字:jōyōkanji --> done isn't really worth it anymore.\r\n\r\nWhen reading Japanese it isn't the kanji that hold me back, it's grammar, phrases, compounds, etc. I presume simply reading a lot while looking up the stuff I don't understand will benefit my reading comprehension way better than continuing what I've done up until now. Everything new I come across this way will have the *huge* benefit of being learned with a context — which is kind of taking my 'learn kanji in the context of words' approach one step further: 'learn vocab and grammar in the context of continuous text'.", "tags": ["japanese", "kanji"], "id": "bd733663", "date": "2015-04-18", "headline": "漢字 — 1800+", "image": "kanji_checkpoint_18.png"}, {"text": "100 kanji, 261 words, 45 days; [Anki stats](static/img/blog/anki_stats_150313.png), [kanji so far](static/dl/kanji_checkpoint_17).\r\n\r\nAs I predicted, exams caused a noticable slowdown. Which would've even been more severe had I not tweaked my learning routine a bit.\r\n\r\nTo save time I decided to stop writing out readings for recognition cards while continuing to write kanji + furigana for recall cards. Curious side effect: I have the feeling this helps me paying more attention to the correct pronunciation of words, since I have to verbalize the word in my head precisely in order to be able to compare my answer to the written solution in Anki. I guess coming up with an answer in a \"verbalizing context\" is somehow different to writing it down.\r\n\r\nAs for recall cards I started trying to always think of the pronunciation of a word first instead of the kanji. Reason: in conversations I need the pronunciation of a word immediately. When writing it is no problem to halt for a few seconds.\r\n\r\n\r\nTwo more weeks of exams to go. Won't manage to get to 1800 in 30 days I guess, but less than 45 should be doable. :)", "date": "2015-03-13", "headline": "漢字 — 1700+", "tags": ["japanese", "kanji"], "id": "d5605b67", "image": "kanji_checkpoint_17.png"}, {"text": "[Pun](https://en.wikipedia.org/wiki/Table_of_Japanese_kanji_radicals) intended. Semi interesting kanji related observation: \r\n\r\nI learn kanji by breaking them down into their parts and building mnemonics out of those. Since not all kanji are either simple — in which case it's reasonable to remember the single strokes — or composed *only* of other kanji, I necessarily have to carry some additional baggage along the way.\r\n\r\nI wondered how this turned out for me up until now and created a [plot](/static/img/blog/kanjitonkc_150202.png). For learning my first 800 kanji I memorized 97 additional non-kanji characters (12% overhead). For the next 800 it was only 13 (1.6% overhead, 6.8% overall).", "date": "2015-02-06", "headline": "Radical overhead", "tags": ["japanese", "kanji"], "id": "a13409f1", "image": "kanjitonkcplot.jpg"}, {"text": "99 kanji, 232 words, 35 days; [Anki stats](static/img/blog/anki_stats_150127.png), [kanji so far](static/dl/kanji_checkpoint_16).\r\n\r\nA minor slowdown. And exams are coming up, so I guess the next 100 will take a bit longer again.\r\n\r\nIt *appears* to be getting harder to find kanji that seem definitively rewarding to learn (i.e. are part of a lot of useful/frequently used words), but I've had such phases a few times before and my feeling always turned out to be incorrect. Given that there are sill 500+ 常用漢字 ahead I *really* hope there's still a bunch of non-obscure ones awaiting me.", "date": "2015-01-27", "headline": "漢字 — 1600+", "tags": ["japanese", "kanji"], "id": "3bb14cdc", "image": "kanji_checkpoint_16.png"}, {"text": "I rebuilt the page with [Python](https://www.python.org/), [Markdown](http://daringfireball.net/projects/markdown/), and [Jinja2](http://jinja.pocoo.org/docs/dev/).\r\n\r\nThe [code](https://github.com/IllDepence/sirtetris.com) should be *a lot* cleaner and for me it's more comfortable to type pages and blog entries in Markdown. There are still a few things to sort out but the current state seems presentable. :3", "date": "2015-01-26", "headline": "Rebuilt in Python", "tags": ["website", "programming"], "id": "35a730d1", "image": "py.png"}, {"text": "99 kanji, 240 words, 33 days; [Anki stats](static/img/blog/anki_stats_141223.png)<sup>[1]</sup>, [kanji so far](static/dl/kanji_checkpoint_15).\r\n\r\nExactly hit the 3 kanji/day average this time. In other words: almost keeping pace. :)\r\n\r\nTandem is still great. Furthermore I have to say that socializing with the local community of Japanese and Japanese learners turned out to be super beneficial on several occasions — apart from the obvious benefit of getting to know interesting people and having a good time. Networking is the buzzword to apply here I guess.\r\n\r\n<p style=\"font-size: 9px;\">[1] From the 24th, prior to adding new cards ... forgot to save a screenshot yesterday. :/</p>", "date": "2014-12-23", "headline": "漢字 — 1500+", "tags": ["japanese", "kanji"], "id": "52333c06", "image": "kanji_checkpoint_15.jpg"}, {"text": "99 kanji, 256 words, 36 days; [Anki stats](static/img/blog/anki_stats_141120.png), [kanji so far](static/dl/kanji_checkpoint_14).\r\n\r\nAlmost keeping pace during lectures and stuff seems to work out so far.\r\n\r\nApart from vocabulary and more interesting at that: living in a larger city now, I'm surrounded with plenty of opportunity for tandem language learning and socializing with Japanese people in general. At the moment I go with two weekly tandem sessions — each of which with a Japanese exchange student.  \r\nGiven that I hardly spoke any Japanese for about a year and only had very simple conversations in class before that I struggle *a lot*. On the other hand, since I have quite a large vocabulary to draw on it's mostly constructing sentences spontaneously which holds me back and I'm making recognizable progress in that regard. Pronunciation causes no problems, nontrivial grammar slowly finds its way into my sentence patterns, listening comprehension is still tough. In any case it's really fun to be able to apply what I've learned so far in real conversations with natives. And getting more and more comfortable with verbally expressing thoughts in a new language is awesome. :3", "date": "2014-11-20", "headline": "漢字 — 1400+", "tags": ["japanese", "kanji"], "id": "9b8e3e23", "image": "kanji_checkpoint_14.png"}, {"text": "101 kanji, 286 words, 34 days; [Anki stats](static/img/blog/anki_stats_141015.png), [kanji so far](static/dl/kanji_checkpoint_13).\r\n\r\nKeeping the pace for now. Moving and stuff was not really time consuming. Lectures will start next week, we'll see how that'll influence my progress.", "date": "2014-10-15", "headline": "漢字 — 1300+", "tags": ["japanese", "kanji"], "id": "dd9836fb", "image": "kanji_checkpoint_13.jpg"}, {"text": "98 kanji, 301 words, 34 days; [Anki stats](static/img/blog/anki_stats_140911.png), [kanji so far](static/dl/kanji_checkpoint_12).\r\n\r\nClose to 100/30 and a nice word/kanji ratio — I'm fine with that. Maybe I'll get to 1300 before Oct 13th, which is when my master's starts. In any case I'll have to deal with moving and stuff before that. Hopefully that won't slow me down a lot. We'll see. :)", "date": "2014-09-11", "headline": "漢字 — 1200+", "tags": ["japanese", "kanji"], "id": "49fc37e4", "image": "kanji_checkpoint_12.png"}, {"text": "100 kanji, 285 words, 41 days. Finally gaining some speed again.\r\n\r\nAs always: [Anki stats](static/img/blog/anki_stats_140808.png) and [kanji so far](static/dl/kanji_checkpoint_11).\r\n\r\nCorrect answers on mature cards sub 90% today, which happens from time to time lately —　<!-- mixlang:集中、集中！:concentrate, damnit! -->\r\n\r\n/edit: okay, if I [really focus](static/img/blog/anki_stats_140809.png) ... (the single one I got wrong was mixing up the meanings of <!-- mixlang:予定:plan/estimate --> and <!-- mixlang:仮定:assumption/hypothesis -->)", "tags": ["japanese", "kanji"], "id": "412c3df8", "date": "2014-08-08", "headline": "漢字 — 1100+", "image": "kanji_checkpoint_11.jpg"}, {"text": "100 kanji, 284 words — almost keeping pace with the last 100. 52 days this time. Which means I'll most likely be at 11xx when finishing my thesis. Unless I'm super busy because of moving after that I'll aim for 30 days per 100 again.\r\n\r\nThe usual stuff: [Anki stats](static/img/blog/anki_stats_140628.png) and [kanji so far](static/dl/kanji_checkpoint_10).\r\n\r\nAdditional data:\r\n\r\n#### Grades\r\n* Grade 1: 80  of 80  (100.0%)\r\n* Grade 2: 160 of 160 (100.0%)\r\n* Grade 3: 176 of 200 (88.0%)\r\n* Grade 4: 128 of 200 (64.0%)\r\n* Grade 5: 102 of 185 (55.1%)\r\n* Grade 6: 93  of 181 (51.4%)\r\n* JuniorHS: 202 of 934 (21.6%)\r\n\r\n#### Distribution\r\n* 1002 total unique kanji\r\n* Jōyō: 977 of 2136 (45.7%)\r\n* Jinmeiyō (regular): 20 of 641 (3.1%)\r\n* 5 non-Jōyō kanji\r\n\r\n‌  \r\nExtrapolating these numbers: when I reach the point of knowing all 2136 Jōyō kanji I'll presumably know 2191 in total, 44 of which will be Jinmeiyō, leaving 11 for non-Jōyō. And if I keep my kanji to vocab ratio at a constant level I'll be at 5671 words.  \r\nIgnoring the fact that I had a [really slow start](static/img/blog/review_count_deck_live_140628.jpg), I'll reach full Jōyō by the end of October 2015. Counting 100 per month beginning in September this year, starting at 11xx, I'd reach 2191 in July 2015. So ... I guess full Jōyō between July and October 2015 is a good guess.\r\n\r\nSince my kanji are distributed between grades/levels to a fair degree, their count is no good indicator for JLPT level. I could imagine taking the N3 in December this year. But I think I'd have to work on a few grammar points for that and I'd definitely have to increase my reading speed. — well, time will tell how I decide. In the end I learn for being able to communicate with Japanese people and read/write, not for a piece of paper. Yet, an official confirmation of \"proficiency\" has something to it.", "date": "2014-06-28", "headline": "漢字 — 1000+", "tags": ["japanese", "kanji"], "id": "62f53ec0", "image": "kanji_checkpoint_10.gif"}, {"text": "100 kanji, 253 words — which took 50 days, meh. But I built a new interactive graph for the [projects page](?c=projects).  \r\nAaand I got a \"Kenkyūsha's New English-Japanese Dictionary\" (5th edition)! — awesome parents be awesome. :3\r\n\r\n[Anki stats](static/img/blog/anki_stats_140507.png).\r\n\r\n[Kanji so far](static/dl/kanji_checkpoint_9).", "date": "2014-05-07", "headline": "漢字 — 900+", "tags": ["japanese", "kanji"], "id": "53833ada", "image": "kanji_checkpoint_9.jpg"}, {"text": "100 kanji, 283 words — writing thesis, Anki on the train while commuting to and from work, not much time in the evening to add new vocab, a bit of reading and writing on [LINE](http://line.me/ja/) but no time for grammar, Lang-8, etc.\r\n\r\n[Anki stats](static/img/blog/anki_stats_140318.png). \r\n\r\n[Kanji so far](static/dl/kanji_checkpoint_8).", "date": "2014-03-18", "headline": "漢字 — 800+", "tags": ["japanese", "kanji"], "id": "26ea4c37", "image": "kanji_checkpoint_8.gif"}, {"text": "100 kanji and 270 words, again in one month and one day — we'll see how that develops once I start writing my thesis in March. :D\r\n\r\nAnyway: [Anki stats](static/img/blog/anki_stats_140212.png) for the last 30 days, [imabi_stroll](http://moc.sirtetris.com/imabi_stroll/) is still going although I got a bit lazy and missed a lot of days.\r\n\r\nA new thing I gave shot is [reading manga](https://plus.google.com/u/0/communities/100379889147661298516) collaboratively (taking turns) in hangouts. It's really fun but the events are at 4 AM for me (GMT+1), which is pretty awful. D: But I will try to continue attending from time to time.\r\n\r\nAs always, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_7).", "date": "2014-02-12", "headline": "漢字 — 700+", "tags": ["japanese", "kanji"], "id": "cdbe6ee9", "image": "kanji_checkpoint_7.png"}, {"text": "Aaand again it's been one month and one day — during which I somehow pumped 98 kanji and 317 words into my brain.\r\n\r\nHere's a screenshot of my [Anki stats](static/img/blog/anki_stats_140111.png) for the last 30 days.\r\n\r\nGrammar: [\"re rush\"](http://moc.sirtetris.com/re_rush/) is completed and helped a lot, now I try to focus on free writing of continuous text instead of single example sentences and only take a look at new grammar topics every 4th day. Since I'm through Tae Kim's Grammar Guide completely I pick interesting topics on IMABI. Schedule: [\"imabi_stroll\"](http://moc.sirtetris.com/imabi_stroll/).\r\n\r\nMisc: had a Skype conversation in Japanese in December which was a nice experience. But I definitely should speak more Japanese.\r\n\r\n‌  \r\nAs always, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_6).", "date": "2014-01-11", "headline": "漢字 — 600+", "tags": ["japanese", "kanji"], "id": "3d745068", "image": "kanji_checkpoint_6.png"}, {"text": "On and on it goes ... 97 kanji and 253 words since the last post.\r\n\r\nI was quite surprised that I missed the '100 kanji per month' mark by just one day (and just one kanji, acutally — I was at 499 yesterday). Anyway, everything good, no changes as for how I learn and here are my [Anki stats](static/img/blog/anki_stats_131210.png).\r\n\r\nGammar! After I finished my [\"grammar rush\"](http://moc.sirtetris.com/grammar_rush/) I stated a [\"re rush\"](http://moc.sirtetris.com/re_rush/). Turned out to be a good strategy so far. No idea what I will do after that though. Maybe start with writing full texts instead of single sentences. Maybe focus on speaking and reduce the time I spent on writing for a while ... we'll see.\r\n\r\nOh and the guys from [Lang-8](http://lang-8.com/) (where I'll write my 100th entry today) are super nice! I found a vulnerability on their site, reported it and they gave me one year premium for my account. :3\r\n\r\nAs always, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_5).", "date": "2013-12-10", "headline": "漢字 — 500+", "tags": ["japanese", "kanji"], "id": "7b41827f", "image": "kanji_checkpoint_5.png"}, {"text": "Soo ... 37 days, 104 kanji and 291 words later:\r\n\r\nNot much to say about kanji learning itself. One thing would be, that due to an [Anki update](http://ankisrs.net/docs/changes.html#changes-in-2.0.13) that changed the handling of sibling cards my second daily Anki session now includes a bit more cards than before and the first session a bit less. Not much of a change.  \r\nI still try to keep the number of reviews due on one day between 80 and 100 but ... as my [Anki stats](static/img/blog/anki_stats_131109.png) reveal, not always manage to do that.\r\n\r\nSince there's nothing more to say about kanji learning, a quick note on grammar:  \r\nAs opposed to vocab, grammar isn't super easily quantified. No numbers, no charts ... Because of that I had a little bit of a problem to continue practicing and learning new grammar for a while.  \r\nTo deal with that I stated a [\"grammar rush\"](http://moc.sirtetris.com/grammar_rush/) (inspired by [this YesJapan video](https://www.youtube.com/watch?v=l-9H_vAx8-I#t=6m57s)). Instead of really just flipping through a workbook and taking notes I read one chapter of [Tae Kim's Grammar Guide](http://www.guidetojapanese.org/learn/grammar) a day and post some example sentences using the new grammar on Lang-8. So far this works really well for me.\r\n\r\nAs always, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_4).", "date": "2013-11-09", "headline": "漢字 — 400+", "tags": ["japanese", "kanji"], "id": "82d546f5", "image": "kanji_checkpoint_4.png"}, {"text": "[God mode](static/img/blog/keima_god_mode.png) activated. :)  \r\nExactly one month ago I wrote 「漢字 — 200+」 and since then addded 280 new words using 100 new kanji to my Anki deck. That means I learned more than nine words per day — which is pretty awesome compared to what I did before.  \r\nLooking at my [Anki stats](static/img/blog/anki_stats_131003.png): I learned every day and added new vocab on 25 of 30 days. On average I review 115 cards in 52 minutes. I require additional time to find new kanji, create mnemonics, find useful new vocab using those kanji, etc. So I guess it's reasonable to assume that I spend about 1.5 hours a day on Japanese vocab. Doesn't sound like an awful lot of time and yet the benefit is quite awesome. :)\r\n\r\nThe most important thing to note is, that I really made it a habit to go through all due Anki cards in the morning/early afternoon, add new kanji in the evening and go through these a bit later. If you're used to it, it's no burden.  \r\nFurther changes in my learning approach: I use [Tagaini Jisho](http://www.tagaini.net/) *a lot* more than before. And I more often use word frequency lists to find new useful vocab. Apart from that ... I sometimes find it useful to not sit in from of my computer with all its distractions when learning, so I use AnkiWeb on my Kindle which works fine.\r\n\r\nAs always, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_3).\r\n", "date": "2013-10-03", "headline": "漢字 — 300+", "tags": ["japanese", "kanji"], "id": "51c3029e", "image": "kanji_checkpoint_3.png"}, {"text": "Strange thing about Amazon: Japanese books (offered on amazon.com and amazon.de) are [not available for the standard Kindle](static/img/blog/jp_kindle_0.jpg) although it's perfectly capable of displaying Japanese content. This applies to *all* books in Japanese. Which sucks. So contacted support concerning that matter ...\r\n\r\nFortunately there are alternatives: [青空文庫 (Aozora Bunko)](http://www.aozora.gr.jp/) offers Japanese books for free and with [青空キンドル (Aozora Kindle)](http://a2k.aill.org/) you can easily convert them to beautiful PDFs. :)  \r\nTo do that, take a book from 青空文庫 (for example [this](http://www.aozora.gr.jp/cards/000311/card2762.html)), scroll down to the ファイルのダウンロード section and copy the URL to the zip file. In our example that's: `http://www.aozora.gr.jp/cards/000311/files/2762_ruby_8768.zip`. Head to 青空キンドル, paste the URL, change settings if you want (I recommend setting the 文字 to 大), hit PDF化, copy the PDF file to your Kindle and you're done. :)  \r\nBeautiful [Japanese](static/img/blog/jp_kindle_1.jpg) on your [Kindle](static/img/blog/jp_kindle_2.jpg). What you may want to avoid, however, is using Japanese file names. They [won't be displayed as expected](static/img/blog/jp_kindle_3.jpg), which I presume it's due to the FAT 32 file system.", "date": "2013-09-08", "headline": "Japanese books for your Kindle", "tags": ["japanese", "hardware"], "id": "662849f9", "image": "jp_kindle.jpg"}, {"text": "Whew ... at last. Turns out a lot of free time doesn't seem to be the best thing for my learning efforts. I tend to approach other time consuming stuff that wouldn't be possible alongside lectures and end up having a hard time keeping up with making progress with my Japanese. D:\r\n\r\nLooking at my [Anki stats](static/img/blog/anki_stats_130903.png) for the last month: the mostly hidden larger gap responsible for that first huge bar was a 5 day trip to Munic for a parkour jam, next gap was a spontaneous programming project iirc (something that doesn't show up in my Google calendar at least) and the third gap was Ludum Dare 27, a video game development competition.\r\n\r\nAnyway: what I'm experimenting with right now is different methods for choosing which kanji to learn next. For some time I sticked with the JLPT kanji listed [here](http://tangorin.com/common_kanji), but it seems to take me longer and longer to find good candidates. I consider switching to going through easy reading material online and adding stuff I don't know yet. Another option would be using some frequency list.\r\n\r\nApart from that everything's going well. Creating mnemonics is still fun. :) Oh and when learning with Anki I now write out readings in katakana instead of hiragana from time to time — helps preventing that I forget those bastards. :D\r\n\r\nAgain, for the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_2).\r\n\r\n", "date": "2013-09-03", "headline": "漢字 — 200+", "tags": ["japanese", "kanji"], "id": "6a66c49c", "image": "kanji_checkpoint_2.png"}, {"text": "So, a mere 5% of Jōyō kanji made their way into my head — and it's been fun so far, A LOT actually! :O\r\n\r\nI can't really say why exactly, but I guess first off because as I continue learning kanji I'm able to read more and more Japanese stuff and also because I can play around with mnemonics. :3  \r\nWhen I wrote about taking Japanese courses in my last post I was totally hyped. But in no way was I ready to get into kanji. I did a lot of preparation because the task seemed (and still seems) huge and I wanted to approach it in the best way possible.  \r\nI thought about learning the 214 radicals before looking at a single kanji, I looked at guides like TextFugu and WaniKani and started hoarding useful resources like [Jim Breen's Multi-Radical Selection](http://www.csse.monash.edu.au/~jwb/cgi-bin/wwwjdic.cgi?1R) ...\r\n\r\n... after about a month I knew how I would do it: TextFugu and the like present a great method for learning kanji effectively, but there are two problems. Frist they focus on kanji only and don't present them in context, as compounds (afaik). Second and most imporantly, they use given mnemonics. No way in hell does it make sense to use other people's associations to remember stuff. If 肉 for me consists of a large gripper and two people which reminds me of Soylent Green and makes it super easy to remember then why should I try to remember it any other way?  \r\nThe thing with the official radicals is that sometimes they don't make sense to me, and for a lot of graphemes of given kanji there are no radicals. I cannot remember 刂 as a mere variation of <!-- mixlang:刀:sword --> — they need very distinct mnemonic names/meanings or I'll mix them up.\r\n\r\nSo ... learning kanji for me works like this: I search for kanji made up of parts I already introduced to my mnemonic system that I'll use in sentences a lot. If I find no good candidates, I search for new graphemes/parts that will \"enable\" useful new kanji. As a new useful kanji is found I try to find at least two ways to use it in sentences — one where a kun reading is used and one where an on reading is used. Super easy example: I know <!-- mixlang:田:rice field --> and <!-- mixlang:力:strength -->, now I find <!-- mixlang:男:man -->, super easy to remember and with <!-- mixlang:男の子:boy (&quot;otokonoko&quot;) --> and <!-- mixlang:男子:boy (&quot;danshi&quot;) --> I already have two readings involved. 男 with it's readings, meanings and a mnemonic wind up in a json file from which I generate a web page displaying all my kanji with memonics and their parts/graphemes linked for ease of use. 男の子 and 男子 are fresh input for my kanji deck in [Anki](http://ankisrs.net/). In the following days I then try to use 男の子 and 男子 in homework for my Japanese courses and in journals on [Lang-8](http://lang-8.com/). And that's how it goes. :) Works really well so far and is a lot of fun. Coming up with good memonics and the populating of previously mentioned json file can be a bit tedious though. ^^\r\n\r\nFor the sake of documentation, these are the [kanji I know so far](static/dl/kanji_checkpoint_1).\r\n\r\nAnd here are my current [Anki stats](static/img/blog/anki_stats_130618.png) (deck created 2013-05-21).\r\n\r\nI plan to do this kind of review every 100 kanji, so there will — hopefully — be a total of 21 of these in the end. Beginning with the second one they'll very likely be notably shorter. ^^\r\n\r\nAnd that's it. Learning kanji is now part of my [ladder to the sun][triceratops with a cap cleaning his mouth with a napkin] life. :3", "tags": ["japanese", "kanji"], "id": "e61bc488", "date": "2013-06-18", "headline": "漢字 — 100+", "image": "kanji_checkpoint_1.png"}, {"text": "I started taking beginner level Japanese courses at uni. The general path to learning the language and regular practice it provides seems to be exactly what was necessary to get me going. My learning efforts — til then not more than learning kana, remembering overused phrases from anime and then stagnating for like ... a year? I don't even know — suddenly skyrocketed and I now have to almost force myself to invest time into all the other stuff I have to do. You know ... my actual field of study and all that. ;P  \r\nAnyway, Japanese, besides being listed as one of my interests, is now also a [project](?c=projects). And btw.: [Lang-8](http://lang-8.com/) is awesome!", "date": "2013-04-19", "headline": "日本語 — at last some serious progress :3", "tags": ["japanese"], "id": "72ecfbb4", "image": "jp_prj.jpg"}, {"text": "Got some stuff that I could have mentioned ... so: combo post!\r\n\r\n#### CLI Love\r\nI took some time to test some alternatives to the software I use on a daily basis. I dropped the window manager [awesome](http://awesome.naquadah.org/) for [spectrwm](https://opensource.conformal.com/wiki/spectrwm) — a lot less crappy configuration, even more minimalistic and quite another approach to multi screen handling (still have to fully get used to it, but seems usable).  \r\nFurthermore I switched from [PCManFM](http://wiki.lxde.org/en/PCManFM) to [ranger](http://ranger.nongnu.org/) ♥ and finally moved on from [VLC media player](http://www.videolan.org/) to [mpd](http://mpd.wikia.com/) + [ncmpc](http://freecode.com/projects/ncmpc) for music and [SMPlayer](http://smplayer.sourceforge.net/) for video matters.\r\n\r\n#### Speedcubing\r\nI attended a speedcubing competition ... just for fun. Now I have this fancy page with official results at the [World Cube Association](http://www.worldcubeassociation.org/results/p.php?i=2013SAIE02). I'm pretty happy with the results as my times really are that inconsistent and I got rather nervous when it got official. I can do sub 30s, but that's only lucky exceptions.\r\n\r\n#### Half-Life\r\nI wondered how long it would take me to play through Half-Life, so I gave it a shot:  \r\n<!-- ytdd:and recorded the hole thing:LuvLcz67zYM -->  \r\n\r\n#### .XCompose kana input\r\nI extended my [.XCompose](https://raw.github.com/IllDepence/dotfiles/master/XCompose) file to now also support katakana instead of hiragana only and added some punctuation that was still missing.\r\n\r\n#### Poral chibi portrait\r\nAlisa created this awesome Portal themed chibi portrait of me that's now accompanying this blog post. :3 Here's her [website](http://sakubik.com/) — read the \"very soon\" in a vaporware-ish \"when it's done\" kind of way. :D", "date": "2013-04-08", "headline": "CLI Love, Speedcubing, Half-Life, etc.", "tags": ["linux", "games", "speedcubing", "japanese"], "id": "e4ffeebd", "image": "cli_cube_hl.jpg"}, {"text": "A few weeks ago I noticed something strange about the ticket machines of [Deutsche Bahn](http://www.bahn.com). Normally, if you miss to hit a button, a red dot on the touch screen indicates where your \"click\" was recognized. But when viewing the *Verkehrsverbund*\\* section and \"missing\" on certain spots on the upper left and upper right corner of the screen, you saw an hourglass cursor for a short moment.  \r\nBeing in curiosity mode I had to [test](static/img/blog/f5.gif) if I could provoke a feedback of some kind. And in fact, rarely the screen was like flashing as I was rapidly clicking on both spots simultaneously.  \r\nAfter playing around a bit more I found out that there are two \"four click combinations\" that will bring up a screen with some information: left, left, right, right gives you the application and system version; left, left, right, left a hole bunch more version data, the location of the machine and whatnot.  \r\nAt the point where I had found the first working combination and began trying out others I kind of felt like in a good old point and click adventure. :D Thanks for the entertainment, Deutsche Bahn. ^^\r\n\r\nHere's a video of each of the screens:  \r\n<!-- ytdd:left, left, right, right:4mojRnjDJBI -->\r\n<!-- ytdd:left, left, right, left:H15ou4VdmCY -->\r\n\r\n\\*An association of public transport authorities.", "date": "2013-02-04", "headline": "Deutsche Bahn ticket machines - hidden buttons", "tags": ["hardware", "libertine"], "id": "6a17efc0", "image": "bahn.jpg"}, {"text": "[The renovation cat](?a=dc18fc96) must have sent it's friend. — I used the last two days to update the site a bit.\r\n\r\nBlog section is now full width, manually chosen permalinks have been replaced by hashes, content has been restructured, the design changed a bit, spam protection is now done with reCAPTCHA, etc.  \r\nFuture plans are to build the site so that it functions perfectly fine w/o JavaScript but, when enabled, makes good use of its benefits, heavily extend the interests section as implied there, etc. However, I guess it's going to take a while until I really find the time to make noticable changes again. I have a lot less free time than I'm used to atm and that's not going to change until February or so. :/", "date": "2012-10-14", "headline": "Site update", "tags": ["website"], "id": "a0f80ae1", "image": "renovation2.jpg"}, {"text": "It is true. No longer will caps lock be the key that you accidentally hit an then hate for what it's doing.\r\n\r\nSo what is this about? A while ago I read about that fantastic idea of making the caps lock key behave like escape on [Wolfgang's blog](http://www.kindofautomatic.de/newblog/?a=0db0b24f7). Which is really an awesome thing, especially for vim users.  \r\nBut we don't want to eliminate caps lock. We want to make use of it. So: I recently switched from a German keyboard layout to a standard US one. Quite soon I realized, that I woudn't mind writing umlauts (äöü) as ae, oe, ue but I'd really miss the s z ligature ‌ß  \r\nIt then occured to me (i.e. after wining about it on irc someone reminded me) that I could use compose. Which I, till then, only used for my beloved dash (—).\r\n\r\nBut something was bothering me: while the origins of the ß are a bit complicated (the story includes the [long s](http://graphemica.com/%C5%BF) (ſ), a character that isn't used anymore, and there were different versions of the ligature using either the z or the s) and German speaking countries that don't use the ß, like Swizerlad, use *ss* instead, it's present name *Eszett* (naming the letters *s* and *z*) and things like the HTML entity being &amp;szlig; (s z ligature) make the ß — for me at least — more a ligature of s and z than of s and s. Yet, the default compose sequence for ß is ss. I had to change that.\r\n\r\nWhile creating my own [.XCompose](https://wiki.archlinux.org/index.php/Accents_on_US_keyboards#Key_combinations) file I had the idea to create compose sequences for [hiragana](http://en.wikipedia.org/wiki/Hiragana) (the reason why that's useful to me is a whole other story). But what would I use? &lt;Multi_key&gt; &lt;a&gt; for あ, &lt;Multi_key&gt; &lt;n&gt; &lt;o&gt; for の, etc.? Would be quite annoying to be forced to hit the compose key (mapped to the [menu key](http://en.wikipedia.org/wiki/Menu_key) in my case) for each and every hiragana. There had to be a better solution.  \r\nI looked into [different input methods for Japanese](https://wiki.archlinux.org/index.php/Input_Japanese_using_uim), but aside from the fact, that they'd clearly be more sophisticated than what I'd come up with (due to me only having *really* basic knowledge of Japanese), they weren't really what I wanted to have.  \r\nI then thought about a separate .XCompose file for hiragana that simply woud map a to あ, n followed by o to の etc. and which I could load using some key combination. Turns out you can't change your .XCompose file on the fly. You have to restart X. :/ (At least I found no way to do it.)\r\n\r\nAfter a while of thinking and testing I had the idea to use a modifier for my hiragana compose sequences. More specifically: a modifier that can be toggled on and of: **CAPSLOCK!**  \r\nWhat this means is, that for example a gets \"composed\" to あ, but only when the modifier is active. The cool thing about that is, that you even have an LED indicator for which \"input mode\" your in. LED off = romaji, LED on = hiragana. This of course can be used for anything. Instead of a hiragana mode you could have a writing upside down mode, a Greek mode, etc.\r\n\r\nIf you want to try it out, here's my current [.Xmodmap](static/dl/.Xmodmap) (swaps escape and caps lock and set's compose to the menu key) and here's my [.XCompose](static/dl/.XCompose) file.", "date": "2012-09-16", "headline": "Making use of caps lock.&emsp;...&emsp;No, seriously.", "tags": ["linux", "japanese"], "id": "079cf21f", "image": "coolcaps.jpg"}, {"text": "Maybe not that interesting, but I felt like this had to appear here. I got my RPi in July and recently started to build a Lego case for it. The one you see on the picture ([fullsize](static/img/blog/rpi0.jpg)) was initially just \"find as much red parts as possible and use the other colors to create a prototype\".  \r\nAfter a while I started to replace strange colors (brown, green, pink, etc.) and black as well as grey bricks in my prototype with similar parts in blue, white or yellow. What you see is how far I got ... a few flat parts and a bigger \"window\" for the LEDs are still to be found. The completely red version is far from complete. I'd need 9 1x1 flat bricks with a flat surface on the top — not sure if we have that much.\r\n\r\nAnyway — the Pi is up and running, serving mostly as an IRC client at the moment; guess it'll have the honor to take care of one or the orther cronjob in the near future and offer some web based \"services\" for me.\r\n\r\nMiscellaneous information: I got the idea to build a Lego case from [Biz's LEGO case](http://www.raspberrypi.org/archives/1354). I used pants for my case because they leave a bit more space inside. Everything located above a slot is fixed to the lid, so the Pi can be taken out once the case is opened withough the need to take it apart. I noticed that my case might not leave enough space for an RCA plug but I don't plan to use it anyway. I use Arch Linux ARM. [Here](static/img/blog/rpi1.jpg)'s a picture of my Raspberry Pi next to a raspberry pie.", "date": "2012-08-14", "headline": "Raspberry Pi + Lego Case :3", "tags": ["hardware", "linux", "lego"], "id": "0b5c23be", "image": "rpi.jpg"}, {"text": "Before I begin with what this is actually about, some words for those who aren't familiar with AniDB, MyAnimelist, XDCC-Bots or at least one of those:  \r\n[AniDB](http://anidb.net/) and [MyAnimelist](http://myanimelist.net/) are both websites that let you create a list of anime titles. In the case of AniDB the focus lies on the anime episodes you have stored somewhere, MyAnimelist cares more about what episodes you saw.  \r\nXDCC bots are IRC bots that send you files on demand. They are a common distribution method for fansubbed anime and offer so called packlists, where the list all the files they offer.\r\n\r\nNow to the real story: I'm a user of both AniDB and MyAnimelist, but I only maintain a list on the latter. I use AniDB of keeping up to date with newly released episodes of airing series. The problem is, that if you only want to see notifies for new releases of certain subgroups, you have to add episodes of the respective anime *from that subgroup* to your list. I, however, don't maintain a list on that site, so I'd get a ton of unnecessary notifies.\r\n\r\nNow, since I get all my new episodes from XDCC bots I though I could make use of simply parsing their packlists, which was the first thing I did: write a [JSON file](http://tareksaier.square7.ch/animu/entries.json) with all neccessary info, a small PHP script to parse the packlist and a [minimalistic site](http://tareksaier.square7.ch/animu/) to display the output. With that I always had an up to date list of all released episodes of the series I watch *and only from the subgroup I want them from*.  \r\nThe problem with that approach was, that I had to memorize the number of the last episode I saw for every of those anime. So I had to come up with something different. Since MyAnimelist always has the information on which episode of which anime I watched last it seemed natural to use that. Also, since I open the page with [my list](http://myanimelist.net/animelist/IllDepence) on it several times a day, it seemed to be a good idea to simply include the information about new episodes there.\r\n\r\nSo I wanted to write a userscript that should obtain the information from both my JSON file and the packlists, look at the site itself and, if there were any episodes released that I hadn't seen, inform me about that ... well, *same origin policy says no*. The userscript is written in JavaScript and common browsers won't let it perform an XMLHttpRequest for stuff stored on other servers than the one the site you are viewing when the script is executed is hosted on.  \r\nI had to find a workaround and I though of JSONP, a method where you create a new script tag in the head of the site with the remote thing you want to access as the src attribute of that tag. Problem is, that remote thing should be a string with a JavaScript method call, so that you actually can use what you got from the remote server. But I wanted to access packlists I had no control over. It then came to my mind, that I simply could write a PHP script that would access and parse the packlist and return a JSONP string — a JSONP proxy you could say. ^^ And then access this with my userscript.\r\n\r\nThis is what I ended up doning. :) My [JSONProxy](http://tareksaier.square7.ch/animu/jsonp.php) parses packlists based on my [listing](http://tareksaier.square7.ch/animu/entries.json) of urls, titles and subgroups and my [userscript](http://tareksaier.bplaced.net/notHP/mab/MALandBots.user.js) ([actual code](http://tareksaier.bplaced.net/notHP/mab/mab.js)) uses that to inform me about new episodes. :3\r\n\r\nI guess it would be quite easy to write a universal JSONProxy which takes a get parameter (the url to the document one wants to access) and returns a JavaScript method call with the whole site as a parameter. What I'm not sure about is, wether or not there are regulations on the src attribute of script tags and how messy the escaping of whole websites for the JS method call would get. ^^  \r\nOh and by the way: since the actual request to the site you do not control (in my case the packlists) is not performed by the browser the JS is running on but by the PHP script on your server this method doesn't even violate the same origin policy more than JSONP itself — it's just a handy way to access data from other servers when you write userscripts. :)", "date": "2012-07-19", "headline": "JSONProxy", "tags": ["programming"], "id": "bc07419d", "image": "jsonproxy.jpg"}, {"text": "A few days ago I read that the *VZ Netzwerke* (a group of dying social networks once popular in Germany) will be renamed to or restarted as *idpool*. Reading about those networks alone reminded me that ever since I stopped using them I wanted to backup all my messages. Hearing that the platform will be undergoing serious change some time soon made me take immediate action.\r\n\r\nI wrote a Perl script to extract the messages and store them in json-files. To view the messages I wrote a simple web interface in PHP.  \r\nI ran into some problems with SSL connections which is why the script uses a session ID instead of an e-mail address and password as a launch parameter. Additionally, when dealing with large amounts of messages the script decided to freeze after a certain amount of parsed messages, so I wrote a second version using threads to parse messages and in case they freeze simply parse the message again. This second version, however, is painfully slow because of my crappy implementation — but since it does a job that only has to be done once I'm fine with that. :D\r\n\r\nConcerning the web interface one thing was very important for me: having messages and answers that belong together being displayed at the same place. A thing that the *VZ Netzwerke* never offered, you only have your in- and outbox. Separated. Absolutely terrible if you want to read an old conversation again. So ... my web interface shows all messages to and from a person at one place. : )\r\n\r\nIn case you'd like to backup your messages too, here you go: [vz_messageparser.tar.gz](static/dl/vz_messageparser.tar.gz)  \r\nRun `perl vzmp.pl studi|schueler|mein <sessid>` (use vmzp_crap.pl if neccessary) and view the index.php (webserver required ofc) as soon as the script finished.\r\n\r\n<!-- ytdd:Here is a video showing how it works.:Mm_LEnnp-mE -->", "date": "2012-06-14", "headline": "VZ Netzwerke message backup", "tags": ["programming"], "id": "5672bf6f", "image": "vzmb.jpg"}, {"text": "edit: modkey + o moves windows between displays — that pretty much solves the whole thing. Sometimes patiently reading though a man page solves your problems more efficiently than asking Google for help. (Thanks to [Wolfgang](http://www.kindofautomatic.de/newblog/) for informing me about the key binding.)\r\n\r\nGetting LibreOffice Impress' extension [presenter-screen](http://www.archlinux.org/packages/extra/x86_64/libreoffice-extension-presenter-screen/) (aka \"Presenter Console\") to work when using [awesome](http://awesome.naquadah.org/) turned out to be a bit tricky.  \r\nSo, if youre using awesome and want to use the extension, here's how it works:\r\n\r\nAssuming you're using a laptop with a resolution of 1366x768 and present on a beamer, connected via VGA with a resolution of 1280x960. (Use xrandr to find out the actual output and resolutions.)\r\n\r\n#### 1. Display setup\r\nYour own screen: xrandr --output LVDS --mode 1366x768 --primary  \r\nThe beamer: xrandr --output VGA-0 --mode 1280x960 --right-of LVDS\r\n\r\n#### 2. Impress\r\nMake sure the extension is recognized: Tools -> Extension Manager  \r\nSet the presentation display to \"Display 2\": Slide Show -> Slide Show Settings  \r\nPlace the Imress window on the beamer display and start the presentation.\r\n\r\nYou should now see the presenter screen on top of your presentation's slides, both on the beamer display.\r\n\r\n#### 3. awesome\r\nWith your cursor, hover over the presenter screen.  \r\nPress modkey + m (maximize window) *twice*.  \r\nMove the presenter screen to your laptop's display.\r\n\r\nThis all would be much easier if there was a key binding for moving (maximized) windows between displays, not only tags. I'm not aware of one.", "date": "2012-05-22", "headline": "Impress Presenter Screen + awesome", "tags": ["linux"], "id": "92549a14", "image": ""}, {"text": "A few weeks ago I thought it would be nice to try out time-lapse photography. I searched for ways to trigger my DSLR in given inverals and found, that the plug for wired remotes was some proprietary Nikon thing and timer remotes cost 40€ upwards.\r\n\r\nFortunately, DSLRs can also be triggered using an infrared signal. I already owned an Nikon ML-L3, a normal IR remote compatible to my Nikon D80. So what I did (and what you can also do to have fun with IR devices) was [**this**](static/img/blog/irremote_tldr.jpg).\r\n\r\nSimply connect an IR LED to an audio cable and use it to record and send IR signals. It's that easy. : )\r\n\r\n‌  \r\nIf you're interested in further information on this topic have a look at the following links:  \r\n[Jim Watters - Nikon D70s MC-DC1 remote](http://photocreations.ca/nikon_d70s/index.html)  \r\n[www.doc-diy.net :: camera remote release pinout list](http://www.doc-diy.net/photo/remote_pinout/)  \r\n[DIY Infrared transmitter for iPhone, iPod](http://www.instructables.com/id/DIY-Infrared-transmitter-for-iPhone-iPod/)  \r\n[Arduino – IR remote/ intervalometer for Nikon D80 DSLR (that means timelapse photography yarrr!)](http://luckylarry.co.uk/arduino-projects/arduino-ir-remote-intervalometer-for-nikon-d80-that-means-timelapse-photography-yarrr/)  \r\n[bigmike.it - infrared remote control for Nikon](http://www.bigmike.it/ircontrol/)", "date": "2012-04-07", "headline": "Time-lapse photography for less than 2&dollar;", "tags": ["hardware", "libertine"], "id": "d9000c79", "image": "irremote.jpg"}, {"text": "Added a \"scrolling\" fuctionality to the grid in the [photography section](?c=photography) — should now be at least a bit more comfortable to browse through. Writing it, however, wasn't that much of a pleasure. :D First of all things tend to end up pretty messy whenever I work on stuff \"combining\" PHP and JS. On top of that the \"math\" behind the shifting of my images went fully out of control. Loops and lists functioning in opposite directions, +1 here, -2 there &mdash; oh well ... somehow it's working now. :D", "date": "2012-03-30", "headline": "Grid scroll", "tags": ["website"], "id": "5827bf62", "image": "gridscroll.jpg"}, {"text": "A few days ago I made a new acquaintance — interesting personality, joyful character; the kind of person you're grateful to have met. The following days I was really keen on further communication — text based due to distance, which, on a side note, actually isn't a bad thing at all. Talking seems to be the right thing to do in order to share experiences, writing appears to be predestined for getting to know someone's wolrd of thought. Anyway: communication at first went fine, but after a while I had the feeling my conversational partner lost interest. The atmosphere kind of infected me and I got all gloomy and listless. This really annoyed me and I tried to find a way out of my bad mood. I thought about what the situation was, what I wanted it to be or how I could view it from a different perspective so that it looked all good again. And then it struck me: *\"Hey ... you're talking to an interesting person. Most people, when you give them some kind of input, come out with some average ouput you won't really consider to be interesting. Here you got someone that, given input, grants you valuable, interesting ouput in exchange. Why don't you simply ask whether or not there's still interest in further communication, whether or not you're annoying/uninteresting? If there's still interest and you're not annoying: go ahead and enjoy this rare personality you consider yourself fortunate having become acquainted with.\"*  \r\nAll of a sudden my mood turned from pretty down to fully enthusiastic again. : )  \r\nAll I did was to take the present situation and put it in a nice frame so that it looked pleasant and motivating again. What I did in the first place was *assuming* that there was something wrong with the situation. What I did to fix it was to realize that I only know my own situation, which actually is fortunate, and that I should ask whether or not the situation of my communicational partner is as it seems to me. As it turned out later my first assumption was completely wrong and I was \"allowed\" to continue being curious and carry on the conversation. :3  \r\nI also realized that I had done this (putting something in a nice frame) before, however I hadn't observed myself and concentrated on what I was doing back then. Anyway: it seems to be a nice technique to handle unpleasant situations: take what you got, consider that you might have made a mistake in the way you currently view the situation, try to fix those mistakes and thus put things in a nice frame. : )", "date": "2012-02-21", "headline": "On the subject of nice frames", "tags": ["self-reflection"], "id": "a54a924d", "image": "frames.jpg"}, {"text": "The [first implementation](?a=132c1dbb) of my movielist made use of IMDBPHP, a third party API thingy. I now finally got rid of it and wrote my own code. Not that IMDBPHP would have been bad in any way, it just was way to heavyweight for what I used it for. Additionally I created a little HTTP [service](?c=service) which can be fed with an IMDb ID and a specification of information type via GET parameters to receive a plain text answer.  \r\nSince both the service and parts of the movielist use fsockopen() — which is disabled on bplaced.net — I have to host them on square7.ch.  \r\nBesides: Vim syntax highlighting (with background set to dark) is just sexy. &lt;3", "date": "2012-02-17", "headline": "Movielist changes + service", "tags": ["website", "movies"], "id": "bb8af8c0", "image": "imdbinfo.jpg"}, {"text": "Whenever I wanted to terminate a program by force I used `ps -A | grep PROGNAME`, read the process id and then executed `sudo kill PID`. Now I wrote a one line bash script making things easier — reducing the required effort by half:\r\n\r\n    #!/bin/bash\r\n    sudo kill `ps -A | grep $1 | grep -Eo '[0-9]{3,4}'`\r\n\r\nAlso usable as a one line command which requires one to enter the program's name afterwards:\r\n\r\n    read x;sudo kill `ps -A | grep $x | grep -Eo '[0-9]{3,4}'`\r\n\r\nThe first version, however, is much more convenient. I stored it as `nkill` in `/usr/bin/` which enables me to for example kill firefox with `nkill firefox` or kill all open terminals with `nkill xterm`.\r\n\r\n**Update:** Uhm ... yeah ... I just learned that pkill does *just that*. :D", "date": "2012-01-24", "headline": "Kill process by name (or: what pkill already does)", "tags": ["linux"], "id": "4a502a4b", "image": ""}, {"text": "On today's schedule:  \r\nlight exercises in JavaScript, regular expressions and Vim. :D\r\n\r\nI finally managed to grant my [Elfen Lied content base](?c=el) a proper functionality to load content on demand. The full page contains images worth >60MB. Combined with slow speed due to free webspace you end up with a browsing experience of pure *\"meh ...\"*. Until now I only hid collapsed content and displayed it on demand. Now expanding and collapsing really means loading the content and removing it. Not only hiding and displaying while loading it anyway.", "date": "2012-01-17", "headline": "Proper subsequent loading of content", "tags": ["website"], "id": "b6edd160", "image": "elcbjs.jpg"}, {"text": "Arch Linux! Wacom! W00t! &lt;3 :D\r\n\r\nOkay ... one thing at a time ... After a good year of using Ubuntu I now switched to [Arch Linux](http://www.archlinux.org). The reason being that I'll be forced to build a system fitting to my needs.  \r\nThanks to the great beginner's guide on archlinux.org I managed to set up a basic system pretty fast and I didn't even run into that much problems. ^^ At the moment I'm using awesome as a window manager — which, btw, is absolutely doing justice to its name —, emelFM2 as my filemanager (also a great component), sxiv for viewing images and apart from that the common stuff that I already used before ... Firefox, VLC, GIMP, XAMPP, etc.\r\n\r\nThe thing that caused the most problems so far and, additionally, the second topic in this blog entry, is my new Wacom Bamoo Pen tablet. I chose a Wacom tablet because I knew about the [Linux Wacom Project](http://sourceforge.net/apps/mediawiki/linuxwacom). Unfortunately the tablet I got is a relatively new model and isn't yet supported by the standard linuxwacom package you get from the repositories. Thus I had to use a package from the AUR, patch it and manually change some stuff — which I managed to do because of the great help I got from some guys from #archlinux.de. : )\r\n\r\nSo ... I now got a new, awesome system and a nice drawing tablet. The only thing I'm missing now is drawing skills. :D But that's fine, I got the tablet mainly for postprocessing of photos and doing stupid things on imageboards. ^^", "date": "2011-12-26", "headline": "Arch and Wacom", "tags": ["linux", "hardware"], "id": "317f2497", "image": "arch.jpg"}, {"text": "‌  \r\n*Le having friend that is huge fan of Zelda franchise\r\n\r\nwild [YouTube video](http://youtu.be/hqMXtNX3KrI) appears\r\n\r\nmake [**this**](static/img/blog/lpc.jpg)", "date": "2011-12-20", "headline": "Link Pixel Cookies!", "tags": ["games", "food"], "id": "a0e249e1", "image": "lpc_prev.jpg"}, {"text": "When you start learning UML and, at first, find it rather annoying and useless, gradually, however, become aware of its usefulness but during that process never stop dealing with it with a lot of humor, then you might end up using domain class diagrams just like \r\n[that](static/img/blog/umltroll.gif).", "date": "2011-12-14", "headline": "UML &mdash; and how to have fun with it", "tags": ["misc"], "id": "520da90d", "image": "uml.jpg"}, {"text": "Since my last blog post several things happened that I could have mentioned here, but I somehow never got around doing so. Therefore I'm now doing a chatch-up post:\r\n\r\n## Parkour\r\nA day after I wrote the *\"Parkour / Freerunning / Movement\"*-post I attended the [parkour theme workshop](http://www.parkour-stuttgart.de/training/themenworkshop) by Parkour Stuttgart, which was a great experience. These workshops are organized every first saturday of each month. Anyone can attend and it's for free. Also worth mentioning: I got into some [serios double kong action](static/img/blog/doublekong.png) lately. ^^\r\n\r\n## Mawaru Penguindrum\r\nIf you happen to be a fan of [Mawaru Penguindrum](http://penguindrum.jp) these two things might be for you. First: I rebuilt the penguin head icon that members of KIGA group have on their shirts as a vector graphic. Here's a [making off](static/img/blog/mpd_makeoff.jpg) (I used [Inkscape](http://inkscape.org)). You can get the SVG file [here](static/dl/pingu.svg). Second: if you'd like to browse through awesome Mawaru Penguindrum fanart take a look at what [zerochan.net](http://www.zerochan.net/Mawaru+Penguindrum?p=1) has to offer. It's nothing but amazing. A four-digit count of really great pictues only on Mawaru Penguindrum. :O<div class=\"imgfloatright\"><img src=\"static/img/blog/oxid.jpg\" /></div>\r\n\r\n## A first attempt in social engineering\r\nOn November 24th Furtwangen University (that's where I study) had a special day for exchange between companies and students. The companies have stands in the hallways and lecture rooms where they introduce themselves. Students walk around to gather information relevant for a practical semester or thesis and harvest giveaways, mostly pens. One of the companies present was [OXID eSales](http://www.oxid-esales.com), they make online shops with PHP. The cool thing at their stand was, that they had t-shirts with PHP code (and their logo ofc) on them which they gave away for free. I quite like PHP, I had to get one of them, so did some of my fellow students. We continued our raid for pens ...  \r\nThen I realized something. The t-shirts that OXID gave away where exactly the same t-shits that their employees wore at their stand. I continued on that thought: people wearing such a shirt standing at their stand are thought to be OXID employees and they're asked questions about the company by students that walk by. I now possess such a shirt ...  \r\nBy now you probably figured out what I was about to do. I asked one of my mates what he thought about temporarily becoming and OXID employee. He liked the idea, we put the t-shirts on and headed off to OXID. In the end the area around the stand wasn't quite crowded enough for the plan to succeed, but the OXID employees that spotted us \"supporting their team\" happened to find it amusing what we did. As you can see they even took a picture of us at their stand.\r\n\r\n## iCTF\r\nAt university we had a team that took part in [The UCSB iCTF](http://ictf.cs.ucsb.edu), an international capture the flag event. The competition was great. The way it was set up allowed members like me, that aren't that skilled when it comes to IT security, to also contribute to the progress of one's team. I was particularly amused by a challenge that I was able to solve thanks to my occasional visits of /b/. [Here](static/img/blog/ictf.png)'s a picture of the challenge. Do you know the answer? If not, take a look at [this](static/img/blog/haikus.jpg).\r\n\r\nIf that post gave you cancer go ahead and write a comment to tell me so!", "date": "2011-12-09", "headline": "Catching up", "tags": ["parkour", "anime", "libertine"], "id": "9e40404a", "image": "ketchup.jpg"}, {"text": "I always was that kind of guy who just *has to* jump over things, climb stuff and find physical challenges whenever being outside. Gone photographing, spotting some stones ... *\"Hold the camera please, I want to jump over these.\"* And [so I did](static/img/blog/parkour2.jpg). *\"Do you think I could do this with one jump from standing position?\"*, *\"Wait, let's try to climb up there!\"* ... you get the idea. ; )\r\n\r\nYet, what I didn't have was some kind of sport that I did. As a kid I was in a gymnastics club. I quit at the age of 12, I guess, and then, for a long, long time ... nothing. At 19 I tried to get into tricking but it didn't really work out. Tricking to me still is one of the &mdash; if not the — most beautiful expression of movement, though.  \r\nEarly this year I got into slacklining, which I still like a lot and do occasionally. But what got me super excited the moment I started was parkour. Or freerunning, or whatever may describe it best what I'm doing. I really don't care a lot about definitions and categories. As long as it isn't necessary to rate or compare within a discipline you don't need to restrict yourself to a certain set of operations or comply to any regulations. And since I'm not driven by the thought *\"I wan't to be good at parkour\"* but instead *\"I wan't to do what makes me happy and what I think is fun\"* I just do that: moving and improving — in whatever way I like to. : )\r\n\r\nWhat I find particularly interesting regarding parkour is the philosophy that developed around it. First there is the thought *\"never stop playing\"* and I couldn't identify more with it. Second there is the idea of creatively using (urban) spaces which I really like. It makes parkour kind of an art that's reaching into the spehre of everyday public life. Third there is this search for efficiency in not only movement but also thinking. It's really a whole bunch of good ideas and interestinng thought that comes along with parkour.\r\n\r\nOn top of that — one last incredibly important thing &mdash; the people are great. From what I've experienced so far, people that are into parkour tend to be extremely supportive, nice, open minded and fun. You'll get help if you need, everyone will encourage each other to try new things. It's just a great environment that supports one's authenticity.\r\n\r\nThus at the moment I'm a bit obsessed with parkour, freerunning, movement in genereal. May it remain like this for a long, long time. : )", "date": "2011-11-04", "headline": "Parkour / Freerunning / Movement", "tags": ["parkour"], "id": "5fd38d56", "image": "parkour.jpg"}, {"text": "<object width=\"526\" height=\"374\"><param name=\"movie\" value=\"http://video.ted.com/assets/player/swf/EmbedPlayer.swf\"></param><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowScriptAccess\" value=\"always\"/><param name=\"wmode\" value=\"transparent\"></param><param name=\"bgColor\" value=\"#ffffff\"></param><param name=\"flashvars\" value=\"vu=http://video.ted.com/talk/stream/2011G/Blank/JaeRhimLee_2011G-320k.mp4&su=http://images.ted.com/images/ted/tedindex/embed-posters/JaeRhimLee_2011G-embed.jpg&vw=512&vh=288&ap=0&ti=1247&lang=eng&introDuration=15330&adDuration=4000&postAdDuration=830&adKeys=talk=jae_rhim_lee;year=2011;theme=a_taste_of_tedglobal_2011;theme=talks_from_ted_fellows;theme=a_greener_future;theme=technology_history_and_destiny;theme=new_on_ted_com;event=TEDGlobal+2011;tag=Arts;tag=Design;tag=death;tag=green;tag=invention;tag=ted+fellows;&preAdTag=tconf.ted/embed;tile=1;sz=512x288;\" /><embed src=\"http://video.ted.com/assets/player/swf/EmbedPlayer.swf\" pluginspace=\"http://www.macromedia.com/go/getflashplayer\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" bgColor=\"#ffffff\" width=\"526\" height=\"374\" allowFullScreen=\"true\" allowScriptAccess=\"always\" flashvars=\"vu=http://video.ted.com/talk/stream/2011G/Blank/JaeRhimLee_2011G-320k.mp4&su=http://images.ted.com/images/ted/tedindex/embed-posters/JaeRhimLee_2011G-embed.jpg&vw=512&vh=288&ap=0&ti=1247&lang=eng&introDuration=15330&adDuration=4000&postAdDuration=830&adKeys=talk=jae_rhim_lee;year=2011;theme=a_taste_of_tedglobal_2011;theme=talks_from_ted_fellows;theme=a_greener_future;theme=technology_history_and_destiny;theme=new_on_ted_com;event=TEDGlobal+2011;tag=Arts;tag=Design;tag=death;tag=green;tag=invention;tag=ted+fellows;&preAdTag=tconf.ted/embed;tile=1;sz=512x288;\"></embed></object>  \r\n**Watch it! Think about it!**  \r\nWonderfully reasonable dealing with death. &lt;3", "date": "2011-10-14", "headline": "Jae Rhim Lee's mushroom burial suit", "tags": ["libertine"], "id": "bbccacc0", "image": ""}, {"text": "#### Stage 1\r\nThe \"News Feed\" is divided into \"Top news\" and \"Most recent\".  \r\nThe so called \"Top News\" are a filtered version of all the news that come up. What is presented to you is, among other things I guess, based on the amount of likes and replies a status update or other news item gets.  \r\nIf you don't want facebook to decide what news you get to see: only view \"Most recent\"\r\n\r\n#### Stage 2\r\nThe news feed section \"Most recent\" has the option \"Show posts from:\" which can be set to \"Friends and pages you interact with the most\" or \"All of your friends and pages\".  \r\nAgain ... Facebook filters. This time according to the amout of interaction you had with the persons in your contact list via Facebook.\r\n\r\n#### Stage 3\r\nFor every person in your contact list you lately have a so called subscription. The default setting for such a subsbsription is \"Most Updates\". (Options are \"All updates\", \"Most Updates\" and \"Only Important\").  \r\nAnd again: why should the user care about all updates and decide for himself, what is important to him and what is not? Let's change the news feed and again cut out stuff that we — Facebook — think is unimportant. **Argh, I hate it!**\r\n\r\n‌  \r\nPersonalized filtering is an interesting thing and, in my humble opinion, even necessary in our days of information oversupply. But I really can not stand it when service providers ***by default*** hold back information, filter your input, infantilize their users.\r\n\r\nTo be fair: it's nice that Facebook at least let's you change the filtering &mdash; I don't want to know how much filtering is done without us knowing about it. But neither have I stumbled across an option to set the default for all subscriptions to \"All updates\" yet, nor am I inclined to change this for all my Facebook contacts manually.  \r\n‌\r\n\r\n#### Update:\r\nWhat the ...?! Less than two hours after I blogged this:\r\n\r\n<img src=\"static/img/blog/infantilizing2.jpg\" />\r\n\r\n**Fuck your goddamn preselection! I want fucking *ALL* my news in fucking chronological order.** \\*facebookrage\\*", "date": "2011-09-21", "headline": "Facebook, three stages of infantilizing", "tags": ["rant"], "id": "ab2c19b1", "image": "infantilizing.jpg"}, {"text": "***Level up!*** for the cinephile. I rebuilt/improved my movielist. : )\r\n\r\nThe old list contained title, year and duration in a rather mediocre conceived notation. Now I note title, year and IMDb id. The first two to still have something human readable and independent from external sources, the third to gather all further data.\r\n\r\nTo access the IMDb page I use [IMDBPHP](http://projects.izzysoft.de/trac/imdbphp), but the methods to sort out the data (rating, runtime, director, etc.) are self written. Since the process of accessing every single IMDb page (one for each movie) takes quite some time, my script saves all information as well as the image in a cache folder.\r\n\r\nThe list can be accessed [here](src/movielist/movies.php).", "date": "2011-09-14", "headline": "Bad-ass movielist", "tags": ["website", "movies"], "id": "132c1dbb", "image": "movielist.jpg"}, {"text": "Took me about 90 minutes to take the pictures.\r\n\r\n<!-- yt:87WgoUNw_rI -->", "date": "2011-07-24", "headline": "Stop motion — a first try", "tags": ["misc"], "id": "3f3e1a7e", "image": ""}, {"text": "Using a forum that has one of these redirection pages for external links that tells you, that you're leaving the site, I lately thought of annoying others by repetitively pasting the link to the redirection page linking to itself before the actual site I was linking to. You'd have to wait for a series of useless pseudo redirections or copy the actual link manually.\r\n\r\nThen, however, I thought you could do something way cooler with *\"You are leaving\"*-pages from different sites. You could create a tour, leaving one page after the other &mdash; you could be: [**leaving the internet**](http://www.intelsols.com/linkexit.cfm?exittitle=__________________________________________________%20_____________________________________________________________________________%20___________________AN_AWESOME_TOUR_TROUGH_LEAVING_PAGES_____________________%20_____________________________________________________________________________%20__________________________ASSEMBLED_BY_ILLDEPENCE_____________________________%20_____________________________________________________________________________&exiturl=http%3A//www.gliderol.co.uk/redirect.php?url=www.bristol.airqualitydata.com/cgi-bin/externallink.cgi?antarcticsun.usap.gov/externalsite.cfm?http%3A//www.openholidayguide.de/redirect.php?url=area17aa.org/area17/redirect.php?url=http%3A//athleteprofessional.com/engine/redirect.php?url=http%3A//www.sendasign-halbe.de/goto.php?url=http%3A//www.khsd.k12.ca.us/Redirector.aspx?RedirectUrl=www.penspinning.de/ref.php?url=https%3A//www.rabobankamerica.com/leaving_site.jsp?url=http%3A//dontknow.me/at/?http%3A//www.studivz.net/Link/Dereferer/?http%3A//www.mobilephonestore.net/redirect.php?url=http%3A//www.webstyles-chinese.info/track.php?l=www.schuelervz.net/Link/Dereferer/?http%3A//communitygarden.info/redirect.php?url=www.usphs.gov/redirect.aspx?URL=http://robocaster.com/redir.aspx?http%3A//tareksaier.bplaced.net).\r\n\r\nSee you soon!<!-- taken out cause down mobiwar.ru/engine/redirect.php?url= -->", "date": "2011-07-11", "headline": "You are leaving the internet", "tags": ["misc"], "id": "1c5bf081", "image": "leaving.jpg"}, {"text": "A fortunate coincidence — or maybe a great estimation of what would be suitable for my person. : )\r\n\r\nI mostly read textbooks, in the majority of cases about philosophy. Somehow novels aren't the kind of books that usually catch my attention. Sadly, because ... not enjoying something is in some way missing something.  \r\nI loved the *Hitchhiker's Guide to the Galaxy* series, enjoyed Stefan Zweig's *The Royal Game* and occasionally read manga. But the rest of what I've read so far ... Precht, Dawkins, Postman, Watzlawick, Nietzsche, etc. — therefore I'm always keen on finding novels I like.\r\n\r\nLast saturday a friend of mine lent me *The Elegance of the Hedgehog* (amazon[.com](http://www.amazon.com/dp/1933372605)/[.de](http://www.amazon.de/dp/3423138149)). She once cited a passage from the book in an e-mail. It looked promising, I got interested. As it turned out this book — at least in my opinion &mdash; is *just perfect* for a person which enjoys reading analytical, philosophical works. It has a touch of such works, yet tells a story, keeps you interestend, is written gorgeously and altogether is just a wonderful book. \\*recommended\\*", "date": "2011-07-10", "headline": "The Elegance of the Hedgehog (Die Eleganz des Igels)", "tags": ["books"], "id": "04e9b323", "image": "igel.jpg"}, {"text": "**\"And then, one day, I got in!\"** (quote from Tron: Legacy)  \r\n— And you should come in, too!  \r\nI've been playing around with Google+ for three days now. Aside from the fact, that Google+ is made by Google, which is reason enough to join, I have to say I really like it. Yes it is [quite simmilar to Facebook](http://xkcd.com/918), but hey: it's a social network and at the moment Facebook is by far the most successful one. If Google+ wasn't quite like Facebook it had to be ... revolutionary — which it is not. But it definitely is woth trying out and as soon as the integration of other Google services is pushed forward, the answer to the question *\"Which social network should I use?\"* is, not only based on image but also based on functionality, **Google+**.\r\n\r\nInteresting stuff: [Inside Google Plus](http://insidegoogleplus.de) (a German blog) and [Google+ Tips and Tricks](https://docs.google.com/document/d/1cUjZ_7rlAmKRDVB6GXId73h_eUdXGKdjtSff0svbaz0/preview?hl=de&pli=1&sle=true) (a collaborative document).\r\n\r\nIf you want to be invited: just send me your e-mail address. ; )", "date": "2011-07-10", "headline": "Google+", "tags": ["misc"], "id": "a403a8c7", "image": "gplus.jpg"}, {"text": "Uhm, yes ... I had to change it again. To be more precise: I built the site again pretty much from scratch. It's as if everytime I remake my page and use it for some time, I find new flaws and the desire to start all over again rises. ^^  \r\nThis time I didn't make any major steps concerning technology — only added a little javascript. The look however changed quite a bit: centered again, uniform color, a picture in the header, different categories and no more name or title (like *&amp;code* before). Greatest changes however were made concerning content. I overhauled most of it.\r\n\r\nOh and: old entries are old. I'm not going to import them ... this is gonna be kind of a new beginning. : )", "date": "2011-06-23", "headline": "Renovation, again.", "tags": ["website"], "id": "dc18fc96", "image": "renovation.jpg"}]